darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
#include "WebServerModule.h"
#include "Version.h"
#include <stdint.h>   // INT32_MIN используется в _handleBackupRestore
#if defined(ESP8266)
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
using WebServerCompat = ESP8266WebServer;
#else
#include <WebServer.h>
#include <WiFi.h>
using WebServerCompat = WebServer;
#endif
#include <ArduinoJson.h>   // ArduinoJson v6 — установить через Library Manager
#include "Memory.h"
#include "Connectivity.h"  // для ntp_sync_time()
#include "Logger.h"
#ifdef USE_SD_CARD
#include <SPI.h>
#include <SD.h>
#include <LittleFS.h>
#elif defined(ESP8266)
#include <LittleFS.h>
#define LOG_FS LittleFS
#elif defined(ESP32)
#include <SPIFFS.h>
#define LOG_FS SPIFFS
#endif

static WebServerCompat _srv(WEB_SERVER_PORT);
static WebData    _wd;
static WebActions _wa;

// ─── CSRF-токен (32 hex-символа, ротируется при каждой перезагрузке) ─────
static char _csrfToken[33] = {0};
static void _csrf_init() {
  if (_csrfToken[0] != '\0') return;
#if defined(ESP8266) || defined(ESP32)
  uint32_t r1 = ESP.getCycleCount() ^ micros();
  uint32_t r2 = millis() ^ (uint32_t)random(0x7FFFFFFF);
#else
  uint32_t r1 = micros();
  uint32_t r2 = millis();
#endif
  snprintf(_csrfToken, sizeof(_csrfToken), "%08lx%08lx%08lx%08lx",
           (unsigned long)r1, (unsigned long)r2,
           (unsigned long)(r1 ^ 0xDEADBEEF), (unsigned long)(r2 ^ 0xCAFEBABE));
}

// ─── Basic Auth проверка (credentials из EEPROM) ─────────────────────────
static bool _auth() {
  char u[24], p[32];
  get_admin_user(u, sizeof(u));
  get_admin_pass(p, sizeof(p));
  if (!_srv.authenticate(u, p)) {
    _srv.requestAuthentication();
    return false;
  }
  return true;
}

// ─── CSRF проверка для state-changing запросов (POST) ────────────────────
// Токен ожидается в заголовке X-CSRF-Token. Клиент получает его через /api/data.
static bool _csrf_check() {
  if (_csrfToken[0] == '\0') _csrf_init();
  String hdr = _srv.header("X-CSRF-Token");
  if (hdr.length() != 32 || strcmp(hdr.c_str(), _csrfToken) != 0) {
    _srv.send(403, "application/json",
              "{\"ok\":false,\"msg\":\"CSRF token missing or invalid\"}");
    return false;
  }
  return true;
}

// ─── Rate limit для дорогих GET-эндпоинтов (1 сек) ───────────────────────
static bool _rate_limit(unsigned long &lastReq, unsigned long minMs) {
  unsigned long now = millis();
  if (lastReq != 0 && (now - lastReq) < minMs) {
    _srv.send(429, "application/json",
              "{\"ok\":false,\"msg\":\"Rate limited\"}");
    return false;
  }
  lastReq = now;
  return true;
}

// ─── Главная HTML страница (хранится во Flash) ────────────────────────────
static const char PAGE_HTML[] PROGMEM = R"rawhtml(
<!DOCTYPE html><html lang="ru"><head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>🐝 BeehiveScale</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
:root{
  --bg:#0d0f0b;--panel:#141710;--border:#2e3829;
  --amber:#f5a623;--amber2:#ffd166;--green:#6fcf97;
  --red:#eb5757;--blue:#56ccf2;--text:#c8d4b8;--text2:#8a9e78;--text3:#506040;
  --mono:'Courier New',monospace;
}
body{background:var(--bg);color:var(--text);font-family:var(--mono);font-size:15px;min-height:100vh}
a{color:var(--amber);text-decoration:none}

.refresh-bar{height:2px;background:var(--border);position:fixed;top:0;left:0;right:0;z-index:200}
.refresh-fill{height:100%;background:var(--amber);transition:width 0.5s linear}

.hdr{background:rgba(20,23,16,.97);border-bottom:1px solid var(--border);padding:8px 24px;position:sticky;top:0;z-index:99;min-height:52px;display:flex;align-items:center;justify-content:center}
.hdr-inner{display:flex;flex-direction:column;align-items:center;gap:0;position:relative;z-index:1}
.hdr-logo{font-size:18px;font-weight:700;letter-spacing:3px;color:var(--amber);text-align:center}
.hdr-sub{font-size:10px;color:var(--text3);letter-spacing:2px}
.hdr-right{position:absolute;left:62%;top:50%;transform:translateY(-50%);
  display:flex;align-items:center;gap:14px;font-size:13px;color:var(--text3)}
.live{display:inline-block;width:7px;height:7px;border-radius:50%;
  background:var(--green);box-shadow:0 0 5px var(--green);animation:pulse 2s infinite;margin-right:5px}
@keyframes pulse{0%,100%{opacity:1}50%{opacity:.3}}

.tabs{display:flex;border-bottom:1px solid var(--border);
  background:rgba(20,23,16,.9);position:sticky;top:52px;z-index:98;overflow-x:auto;
  justify-content:center;padding:0}
.tab{padding:10px 18px;font-size:13px;letter-spacing:1px;color:var(--text3);
  border-bottom:2px solid transparent;cursor:pointer;white-space:nowrap;text-transform:uppercase;
  background:none;border-top:none;border-left:none;border-right:none;font-family:var(--mono)}
.tab:hover{color:var(--text2)}
.tab.active{color:var(--amber);border-bottom-color:var(--amber)}

.section{display:none;padding:20px 24px;max-width:1080px;margin:0 auto;width:100%}
.section.active{display:block}

.grid{display:grid;grid-template-columns:1fr 1fr;gap:12px}
.grid-3{display:grid;grid-template-columns:1fr 1fr 1fr;gap:10px}
.grid-auto{display:grid;grid-template-columns:repeat(auto-fill,minmax(180px,1fr));gap:8px}
@media(max-width:700px){.grid,.grid-3{grid-template-columns:1fr}}

.card{background:var(--panel);border:1px solid var(--border);padding:14px;position:relative;overflow:hidden}
.card::before{content:'';position:absolute;top:0;left:0;right:0;height:2px;
  background:linear-gradient(90deg,var(--amber),transparent)}
.card.blue::before{background:linear-gradient(90deg,var(--blue),transparent)}
.card.green::before{background:linear-gradient(90deg,var(--green),transparent)}
.card.red::before{background:linear-gradient(90deg,var(--red),transparent)}
.card.full{grid-column:1/-1}
.card-title{font-size:12px;letter-spacing:2px;color:var(--text3);text-transform:uppercase;margin-bottom:12px;display:flex;align-items:center;justify-content:space-between}
.card-title span{cursor:pointer;color:var(--text3);font-size:11px}
.card-title span:hover{color:var(--amber)}

.val-big{font-size:42px;font-weight:700;color:var(--amber);line-height:1;letter-spacing:-1px}
.val-unit{font-size:18px;color:var(--text2);margin-left:3px}
.val-sub{font-size:12px;color:var(--text3);margin-top:6px;line-height:1.7}

.gauge-wrap{display:flex;align-items:center;gap:8px;margin-top:8px}
.gauge{flex:1;height:4px;background:var(--border)}
.gauge-fill{height:100%;background:var(--amber);transition:width .5s}
.gauge-lbl{font-size:12px;color:var(--text3);min-width:40px;text-align:right}

.status-row{display:flex;align-items:center;gap:8px;padding:6px 0;
  border-bottom:1px solid #1c2018;font-size:13px}
.status-row:last-child{border:none}
.dot{width:8px;height:8px;border-radius:50%;flex-shrink:0}
.dot.ok{background:var(--green);box-shadow:0 0 4px var(--green)}
.dot.err{background:var(--red);box-shadow:0 0 4px var(--red)}
.dot.warn{background:var(--amber);box-shadow:0 0 4px var(--amber)}
.status-lbl{flex:1;color:var(--text2)}
.status-val{color:var(--text);font-size:13px;text-align:right}

.btn{display:inline-flex;align-items:center;justify-content:center;font-family:var(--mono);
  font-size:12px;letter-spacing:1px;padding:9px 16px;border:1px solid;cursor:pointer;
  background:transparent;transition:all .15s;text-transform:uppercase;gap:6px}
.btn-amber{border-color:var(--amber);color:var(--amber)}
.btn-amber:hover{background:var(--amber);color:#000}
.btn-red{border-color:var(--red);color:var(--red)}
.btn-red:hover{background:var(--red);color:#fff}
.btn-green{border-color:var(--green);color:var(--green)}
.btn-green:hover{background:var(--green);color:#000}
.btn-blue{border-color:var(--blue);color:var(--blue)}
.btn-blue:hover{background:var(--blue);color:#000}
.btn:disabled{opacity:.4;cursor:not-allowed}
.btn:active{transform:scale(0.96)}
.btn-row{display:flex;gap:8px;flex-wrap:wrap;margin-top:10px}

.form-row{margin-bottom:12px}
.form-row label{display:block;font-size:11px;letter-spacing:1.5px;color:var(--text3);
  text-transform:uppercase;margin-bottom:5px}
input,select{background:#1c2018;border:1px solid var(--border);color:var(--text);
  font-family:var(--mono);font-size:13px;padding:9px 12px;outline:none;width:100%}
input:focus,select:focus{border-color:var(--amber)}
input[type=checkbox]{width:auto}

