darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
/* ── WiFi mode cards ── */
.wm-opts{display:flex;gap:8px;margin-bottom:12px}
.wm-opt{flex:1;background:#1c2018;border:1px solid var(--border);padding:14px 10px;cursor:pointer;
  display:flex;flex-direction:column;align-items:center;justify-content:center;text-align:center;gap:8px;min-height:130px;transition:border-color .15s}
.wm-opt:hover{border-color:var(--text3)}
.wm-opt.sel{border-color:var(--amber)}
.wm-opt input[type=radio]{accent-color:var(--amber)}
.wm-opt-body{font-size:13px;line-height:1.8;color:var(--text2);text-align:center}
.wm-opt-body b{color:var(--text);font-size:14px;display:block;margin-bottom:4px}
.wm-opt-body small{color:var(--text3);font-size:12px}

/* ── Pass change ── */
.pass-section{border-top:1px solid var(--border);padding-top:12px;margin-top:12px}
.pass-row{display:flex;gap:8px;align-items:flex-end}
.pass-row .form-row{flex:1;margin:0}
.pass-strength{height:3px;background:var(--border);margin-top:4px;transition:all .2s}

/* ── Chart ── */
.chart-container{position:relative;margin-bottom:10px}
.chart-svg{width:100%;display:block;overflow:visible}
.period-tabs{display:flex;gap:4px;margin-bottom:8px;flex-wrap:wrap}
.period-btn{padding:5px 12px;font-size:12px;letter-spacing:1px;border:1px solid var(--border);
  background:transparent;color:var(--text3);cursor:pointer;font-family:var(--mono);text-transform:uppercase}
.period-btn.active{border-color:var(--amber);color:var(--amber)}
.series-btns{display:flex;gap:4px;flex-wrap:wrap}
.ser-btn{padding:5px 12px;font-size:12px;border:1px solid var(--border);background:transparent;
  color:var(--text3);cursor:pointer;font-family:var(--mono)}
.ser-btn.active{background:#1c2018}
.ser-btn.s-w.active{border-color:var(--amber);color:var(--amber)}
.ser-btn.s-t.active{border-color:var(--blue);color:var(--blue)}
.ser-btn.s-b.active{border-color:var(--green);color:var(--green)}

/* ── Tooltip ── */
.tip{position:absolute;display:none;background:rgba(13,15,11,.95);border:1px solid var(--border);
  padding:6px 10px;font-size:10px;pointer-events:none;z-index:50;line-height:1.6;min-width:120px}

/* ── Export panel ── */
.exp-panel{background:#0f1209;border:1px solid var(--border);padding:12px;margin-top:10px;position:relative;z-index:10}
.exp-panel-title{font-size:12px;letter-spacing:2px;color:var(--text3);text-transform:uppercase;margin-bottom:10px}
.exp-cols{display:flex;flex-direction:column;gap:4px}
.exp-col-item{display:flex;align-items:center;gap:8px;font-size:13px;color:var(--text2);cursor:pointer}
.exp-col-item input{width:auto}
.exp-date-row{display:flex;gap:8px;margin-bottom:10px}
.exp-date-row .form-row{flex:1;margin:0}

/* ── API ── */
.api-grid{display:grid;grid-template-columns:repeat(auto-fill,minmax(200px,1fr));gap:6px;margin-top:8px}
.api-item{background:#1c2018;padding:10px 12px;border:1px solid var(--border);font-size:12px}
.api-method{font-weight:700;margin-bottom:2px}
.api-desc{color:var(--text3)}
.get{color:var(--green)}.post{color:var(--amber)}.del{color:var(--red)}

/* ── Info tiles ── */
.info-tile{background:#1c2018;border:1px solid var(--border);padding:8px 10px}
.info-tile .lbl{font-size:11px;color:var(--text3);letter-spacing:1px;margin-bottom:4px;text-transform:uppercase}
.info-tile .val{font-size:17px}

/* ── Calibration wizard ── */
.wiz-steps{display:flex;gap:0;margin-bottom:12px}
.wiz-step{flex:1;text-align:center;padding:6px 3px;font-size:11px;letter-spacing:.5px;
  border-bottom:2px solid var(--border);color:var(--text3);text-transform:uppercase}
.wiz-step.active{border-color:var(--amber);color:var(--amber)}
.wiz-step.done{border-color:var(--green);color:var(--green)}
.wiz-body{background:#1c2018;border:1px solid var(--border);padding:14px;min-height:80px;font-size:13px;line-height:1.8}

/* ── Toast ── */
.toast{position:fixed;bottom:16px;right:16px;z-index:500;font-family:var(--mono);font-size:11px;
  padding:10px 16px;border:1px solid var(--green);background:rgba(13,15,11,.97);color:var(--green);
  letter-spacing:1px;transform:translateX(220%);transition:transform .3s;max-width:280px}
.toast.show{transform:none}
.toast.err{border-color:var(--red);color:var(--red)}

/* ── Preview table ── */
.prev-wrap{overflow-x:auto;margin-top:10px}
.prev-table{width:100%;border-collapse:collapse;font-size:12px}
.prev-table th{background:#1c2018;color:var(--text3);padding:6px 10px;border:1px solid var(--border);
  text-align:left;font-weight:normal;letter-spacing:1px;text-transform:uppercase;font-size:11px}
.prev-table td{padding:5px 10px;border:1px solid var(--border);color:var(--text2)}
.prev-table tr:hover td{background:#1a1e15}

/* ── Wiz step bar ── */
.wiz-actions{display:flex;gap:8px;margin-top:10px;align-items:center}
.wiz-cur-w{font-size:13px;color:var(--text3);margin-left:auto}
</style>
</head>
<body>

<div class="refresh-bar"><div class="refresh-fill" id="rbar" style="width:100%"></div></div>

<div id="creds-warn" style="display:none;background:#3b1c18;border-bottom:2px solid var(--red);padding:10px 16px;text-align:center;color:var(--red);font-size:13px;letter-spacing:1px">
  ⚠ Используются стандартные учётные данные (admin/beehive). Смените пароль в разделе <a href="#" onclick="nav('wifi');return false" style="color:var(--amber);text-decoration:underline">Wi-Fi → Пароли и доступ</a>.
</div>

<div class="hdr">
  <div class="hdr-inner">
    <div class="hdr-logo">🐝 BeehiveScale <span id="fw-ver" style="font-size:12px;color:var(--text2);font-weight:400;margin-left:8px"></span></div>
  </div>
  <div class="hdr-right">
    <div class="hdr-sub" style="margin-right:16px">LIVE MONITOR · ESP8266</div>
    <span><span class="live"></span>ONLINE</span>
    <span id="cur-time">--:--:--</span>
  </div>
</div>

<div class="tabs">
  <button class="tab active"  onclick="nav('main')">⌂ Главная</button>
  <button class="tab"         onclick="nav('chart')">📈 График + Экспорт</button>
  <button class="tab"         onclick="nav('wifi')">📶 Wi-Fi</button>
  <button class="tab"         onclick="nav('settings')">⚙ Настройки</button>
  <button class="tab"         onclick="nav('calib')">⚖ Калибровка</button>
  <button class="tab"         onclick="nav('tg')">✉ Telegram</button>
  <button class="tab"         onclick="nav('api')">🔌 API</button>
</div>

<!-- ═══════════════ MAIN ═══════════════ -->
<div class="section active" id="sec-main">
  <div class="grid">

    <div class="card">
      <div class="card-title">⚖ Текущий вес</div>
      <div class="val-big" id="w-val">--<span class="val-unit">кг</span></div>
      <div class="val-sub">Эталон: <b id="w-ref">--</b> кг &nbsp;|&nbsp; Δ: <b id="w-delta" style="color:var(--amber2)">--</b> кг</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="w-gauge" style="width:0%"></div></div>
        <div class="gauge-lbl" id="w-gpct">0%</div>
      </div>
    </div>

    <div class="card blue">
      <div class="card-title">🌡 Температура / Влажность</div>
      <div class="val-big" id="t-val">--<span class="val-unit">°C</span></div>
      <div class="val-sub">RTC: <b id="rtc-val">--</b>°C</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="t-gauge" style="width:0%;background:var(--blue)"></div></div>
        <div class="gauge-lbl" id="t-gpct">--°C</div>
      </div>
    </div>

    <div class="card">
      <div class="card-title">🔋 Батарея</div>
      <div class="val-big" id="bat-v-big">--<span class="val-unit">В</span></div>
      <div class="val-sub">Заряд: <b id="bat-pct-v">--%</b></div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="bat-gauge" style="width:0%;background:var(--green)"></div></div>
        <div class="gauge-lbl" id="bat-gpct">--%</div>
      </div>
      <div class="card-title" style="margin-top:12px;font-size:11px;color:var(--text2)">💾 Лог / Память</div>
      <div class="val-sub">Занято: <b id="mem-used">--</b> КБ из <b id="mem-total">--</b> КБ</div>
      <div class="gauge-wrap">
        <div class="gauge"><div class="gauge-fill" id="mem-gauge" style="width:0%;background:var(--green)"></div></div>
        <div class="gauge-lbl" id="mem-gpct">--%</div>
      </div>
    </div>

    <div class="card">
      <div class="card-title">📡 Статус системы</div>
      <div class="status-row"><div class="dot warn" id="sr-dot"></div><div class="status-lbl">HX711 датчик</div><div class="status-val" id="sr-val">…</div></div>
      <div class="status-row"><div class="dot warn" id="wf-dot"></div><div class="status-lbl">Wi-Fi</div><div class="status-val" id="wf-val">…</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Веб-сервер</div><div class="status-val">Активен :80</div></div>
      <div class="status-row"><div class="dot ok" id="sd-dot"></div><div class="status-lbl">Хранилище лог</div><div class="status-val" id="sd-val">--</div></div>
      <div class="status-row"><div class="dot ok" id="heap-dot"></div><div class="status-lbl">Free Heap</div><div class="status-val" id="heap-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Пробуждений</div><div class="status-val" id="wkc-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Cal. Factor</div><div class="status-val" id="cf-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Offset</div><div class="status-val" id="ofs-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Дата/время</div><div class="status-val" id="dt-val">--</div></div>
      <div class="status-row"><div class="dot ok"></div><div class="status-lbl">Uptime</div><div class="status-val" id="upt-val">--</div></div>
    </div>

    <div class="card full">
      <div class="card-title">🐝 Информация об улье (сегодня)</div>
      <div class="grid-auto">
        <div class="info-tile"><div class="lbl">Сезон</div><div class="val" style="color:var(--amber)" id="hi-season">--</div></div>
        <div class="info-tile"><div class="lbl">Вес мин / макс</div><div class="val" style="color:var(--green);font-size:12px" id="hi-wrange">--/-- кг</div></div>
        <div class="info-tile"><div class="lbl">Темп мин / макс</div><div class="val" style="color:var(--blue);font-size:12px" id="hi-trange">--/-- °C</div></div>
        <div class="info-tile"><div class="lbl">Изменение за день</div><div class="val" id="hi-delta">-- кг</div></div>
        <div class="info-tile"><div class="lbl">Точек сегодня</div><div class="val" style="color:var(--text2)" id="hi-count">--</div></div>
        <div class="info-tile"><div class="lbl">Дней наблюдений</div><div class="val" style="color:var(--text2)" id="hi-days">--</div></div>
      </div>
    </div>

    <div class="card full">
      <div class="card-title">
        📈 Мини-график
        <span onclick="nav('chart')">[открыть полный →]</span>
      </div>
      <div class="chart-container" style="height:350px">
        <div class="tip" id="tip-mini"></div>
        <svg id="mini-svg" class="chart-svg" viewBox="0 0 900 350" preserveAspectRatio="xMidYMid meet"
             onmousemove="onTip(event,'mini')" onmouseleave="hideTip('mini')">
          <text x="450" y="130" text-anchor="middle" fill="#506040" font-size="12">Загрузка...</text>
        </svg>
      </div>
    </div>


