darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
  </div>
</div>

<!-- ═══════════════ CHART + EXPORT ═══════════════ -->
<div class="section" id="sec-chart">

  <!-- Верхняя панель управления графиком -->
  <div class="card" style="margin-bottom:10px">
    <div style="display:flex;justify-content:space-between;align-items:center;flex-wrap:wrap;gap:8px;margin-bottom:10px">
      <div class="period-tabs" style="margin:0">
        <button class="period-btn active" onclick="setPeriod(1,this)">1ч</button>
        <button class="period-btn" onclick="setPeriod(6,this)">6ч</button>
        <button class="period-btn" onclick="setPeriod(24,this)">24ч</button>
        <button class="period-btn" onclick="setPeriod(72,this)">3д</button>
        <button class="period-btn" onclick="setPeriod(168,this)">7д</button>
        <button class="period-btn" onclick="setPeriod(0,this)">Всё</button>
      </div>
      <div class="series-btns">
        <button class="ser-btn s-w active" id="sb-w" onclick="toggleSeries('w',this)">⚖ Вес</button>
        <button class="ser-btn s-t active" id="sb-t" onclick="toggleSeries('t',this)">🌡 Темп</button>
        <button class="ser-btn s-b active" id="sb-b" onclick="toggleSeries('b',this)">🔋 Батарея</button>
      </div>
    </div>

    <!-- График веса -->
    <div class="chart-container" id="cwrap-w" style="height:280px;margin-bottom:20px">
      <div class="tip" id="tip-w"></div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:4px">
        Мин: <b id="c-wmin" style="color:var(--amber)">--</b> &nbsp;
        Макс: <b id="c-wmax" style="color:var(--amber)">--</b> &nbsp;
        Среднее: <b id="c-wavg" style="color:var(--amber)">--</b> кг &nbsp;
        Точек: <b id="c-pts">0</b>
      </div>
      <svg id="chart-w" class="chart-svg" viewBox="0 0 900 260" preserveAspectRatio="xMidYMid meet"
           onmousemove="onTip(event,'w')" onmouseleave="hideTip('w')">
        <text x="450" y="120" text-anchor="middle" fill="#506040" font-size="12">Загрузка...</text>
      </svg>
    </div>

    <!-- График температуры -->
    <div class="chart-container" id="cwrap-t" style="height:280px;margin-bottom:20px;border-top:1px solid var(--border);padding-top:14px">
      <div class="tip" id="tip-t"></div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:4px">
        Темп мин: <b id="c-tmin" style="color:var(--blue)">--</b> &nbsp;
        Макс: <b id="c-tmax" style="color:var(--blue)">--</b> °C
      </div>
      <svg id="chart-t" class="chart-svg" viewBox="0 0 900 260" preserveAspectRatio="xMidYMid meet"
           onmousemove="onTip(event,'t')" onmouseleave="hideTip('t')">
        <text x="450" y="120" text-anchor="middle" fill="#506040" font-size="12">Загрузка...</text>
      </svg>
    </div>

    <!-- График батареи -->
    <div class="chart-container" id="cwrap-b" style="height:280px;border-top:1px solid var(--border);padding-top:14px">
      <div class="tip" id="tip-b"></div>
      <svg id="chart-b" class="chart-svg" viewBox="0 0 900 260" preserveAspectRatio="xMidYMid meet"
           onmousemove="onTip(event,'b')" onmouseleave="hideTip('b')">
        <text x="450" y="120" text-anchor="middle" fill="#506040" font-size="12">Загрузка...</text>
      </svg>
    </div>
  </div>

  <!-- ── Панель экспорта ── -->
  <div class="exp-panel">
    <div class="exp-panel-title">⬇ Экспорт данных</div>

    <div class="exp-date-row">
      <div class="form-row"><label>С даты</label><input type="date" id="exp-from"></div>
      <div class="form-row"><label>По дату</label><input type="date" id="exp-to"></div>
    </div>

    <div style="display:flex;gap:20px;flex-wrap:wrap;margin-bottom:12px">
      <div>
        <div style="font-size:12px;letter-spacing:1px;color:var(--text3);text-transform:uppercase;margin-bottom:6px">Столбцы</div>
        <div class="exp-cols">
          <label class="exp-col-item"><input type="checkbox" id="col-dt" checked> Дата/время</label>
          <label class="exp-col-item"><input type="checkbox" id="col-w"  checked> Вес (кг)</label>
          <label class="exp-col-item"><input type="checkbox" id="col-t"  checked> Температура (°C)</label>
          <label class="exp-col-item"><input type="checkbox" id="col-bat"> Батарея (В)</label>
        </div>
      </div>
      <div>
        <div style="font-size:12px;letter-spacing:1px;color:var(--text3);text-transform:uppercase;margin-bottom:6px">Листы Excel</div>
        <div style="font-size:13px;color:var(--text3);line-height:1.9">
          ✓ «Данные» — все записи<br>
          ✓ «Статистика» — мин/макс/среднее<br>
          ✓ «Дневные итоги» — группировка
        </div>
      </div>
      <div>
        <div style="font-size:12px;letter-spacing:1px;color:var(--text3);text-transform:uppercase;margin-bottom:6px">Прямое скачивание с SD</div>
        <div class="btn-row" style="margin:0;flex-direction:column;gap:6px">
          <button class="btn btn-green" style="width:100%" onclick="window.open('/api/log','_blank')">📥 Весь CSV (SD-карта)</button>
          <div style="display:flex;gap:6px">
            <input type="date" id="exp-date-sd" style="flex:1;padding:5px 8px">
            <button class="btn btn-amber" onclick="dlSdDate()">📥 За дату</button>
          </div>
        </div>
      </div>
    </div>

    <div class="btn-row">
      <button class="btn btn-green" onclick="exportExcel()">📊 Скачать Excel (.xlsx)</button>
      <button class="btn btn-amber" onclick="exportCsv()">📄 Скачать CSV</button>
      <button class="btn btn-blue"  onclick="previewExport()">👁 Предпросмотр</button>
      <button class="btn btn-red"   onclick="if(confirm('Очистить лог?'))doApi('/api/log/clear')">🗑 Очистить лог</button>
    </div>

    <div id="preview-wrap" style="display:none">
      <div style="font-size:12px;color:var(--text3);margin-top:10px;letter-spacing:1px;text-transform:uppercase">
        Предпросмотр (последние 10 строк)
      </div>
      <div class="prev-wrap">
        <table class="prev-table" id="prev-table"></table>
      </div>
    </div>
  </div>
</div>

<!-- ═══════════════ WIFI ═══════════════ -->
<div class="section" id="sec-wifi">
  <div class="grid">

    <!-- Режим подключения -->
    <div class="card">
      <div class="card-title">📶 Режим подключения</div>
      <div class="wm-opts">
        <div class="wm-opt sel" id="wopt-ap" onclick="selWm(0)">
          <input type="radio" name="wm" checked>
          <div class="wm-opt-body">
            <b>📡 Точка доступа (AP)</b>
            <small>Устройство создаёт свою сеть<br>SSID: BeehiveScale<br>IP: 192.168.4.1</small>
          </div>
        </div>
        <div class="wm-opt" id="wopt-sta" onclick="selWm(1)">
          <input type="radio" name="wm">
          <div class="wm-opt-body">
            <b>🌐 Роутер (STA)</b>
            <small>Подключение к домашнему Wi-Fi<br>IP: назначает роутер (DHCP)<br>NTP и Telegram доступны</small>
          </div>
        </div>
      </div>
      <div id="sta-block" style="display:none">
        <div class="form-row"><label>SSID роутера</label><input type="text" id="wifi-ssid" placeholder="Название вашей Wi-Fi сети" maxlength="32" autocomplete="off"></div>
        <div class="form-row"><label>Пароль роутера</label><input type="password" id="wifi-pass" placeholder="Пароль (оставьте пустым чтобы не менять)" maxlength="32" autocomplete="new-password"></div>
      </div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="saveWifi()">💾 Сохранить и перезагрузить</button>
        <button class="btn btn-blue"  onclick="doApi('/api/ntp')">🕐 NTP Время</button>
      </div>
      <div style="font-size:13px;color:var(--text3);margin-top:10px;line-height:1.7">
        <b style="color:var(--amber)">AP режим:</b> прямое подключение к устройству → 192.168.4.1<br>
        <b style="color:var(--amber)">STA режим:</b> устройство в вашей сети → доступен NTP и Telegram
      </div>
    </div>

    <!-- Смена паролей -->
    <div class="card">
      <div class="card-title">🔒 Пароли и доступ</div>

