darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
      <!-- Пароль AP точки доступа -->
      <div style="margin-bottom:14px">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Пароль сети AP (BeehiveScale)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль (8–23 символа)</label>
          <input type="password" id="ap-pass-new" placeholder="••••••••" maxlength="23" autocomplete="new-password" oninput="checkPassStrength('ap-pass-new','ap-pass-str')">
          <div class="pass-strength" id="ap-pass-str"></div>
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Повтор пароля</label>
          <input type="password" id="ap-pass-confirm" placeholder="••••••••" maxlength="23" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveApPass()">🔑 Сменить пароль AP</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          Применится после перезагрузки. После смены подключайтесь к AP с новым паролем.
        </div>
      </div>

      <!-- Пароль веб-интерфейса -->
      <div class="pass-section">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Веб-авторизация (admin)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Логин (оставьте пустым чтобы не менять)</label>
          <input type="text" id="web-user-new" placeholder="admin" maxlength="23" autocomplete="off">
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль (6-31)</label>
          <input type="password" id="web-pass-new" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Повтор пароля</label>
          <input type="password" id="web-pass-confirm" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveWebAuth()">🔑 Сменить пароль web</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          После смены браузер запросит новый логин/пароль при первом запросе.
        </div>
      </div>

      <!-- OTA пароль -->
      <div class="pass-section">
        <div style="font-size:13px;color:var(--text2);margin-bottom:8px;font-weight:600">Пароль OTA (прошивка по воздуху)</div>
        <div class="form-row" style="margin-bottom:6px">
          <label>Новый пароль OTA (6-31)</label>
          <input type="password" id="ota-pass-new" placeholder="********" maxlength="31" autocomplete="new-password">
        </div>
        <button class="btn btn-amber" onclick="saveOtaPass()">🔑 Сменить OTA пароль</button>
        <div style="font-size:13px;color:var(--text3);margin-top:6px">
          Вступит в силу после перезагрузки.
        </div>
      </div>
    </div>

  </div>
</div>

<!-- ═══════════════ SETTINGS ═══════════════ -->
<div class="section" id="sec-settings">
  <div class="grid">
    <div class="card">
      <div class="card-title">⚙ Параметры устройства</div>
      <div class="form-row"><label>Порог тревоги Telegram (кг, 0.1–10)</label><input type="number" id="cfg-alert" step="0.1" min="0.1" max="10" placeholder="0.5"></div>
      <div class="form-row"><label>Эталонный груз калибровки (г, 100–50000)</label><input type="number" id="cfg-calib" step="100" min="100" max="50000" placeholder="1000"></div>
      <div class="form-row"><label>Скорость отклика весов (0.1=медленно, 0.3=средне, 0.6=быстро)</label><input type="number" id="cfg-ema" step="0.05" min="0.05" max="0.9" placeholder="0.3"><div style="font-size:12px;color:var(--text3);margin-top:4px">EMA α-фильтр. <b>0.1</b> ≈ 30 сек до стабилизации (для улья, фильтрует пчёл). <b>0.3</b> ≈ 10 сек (рекомендуется). <b>0.6</b> ≈ 4 сек (для тестов/калибровки).</div></div>
      <div class="form-row"><label>Deep Sleep интервал (сек, 30–86400)</label><input type="number" id="cfg-sleep" step="60" min="30" max="86400" placeholder="900"></div>
      <div class="form-row"><label>Расписание замеров (HH:MM через пробел, до 8 времён)</label><input type="text" id="cfg-sched" placeholder="08:00 14:00 20:00" maxlength="60"></div>
      <div class="form-row"><label>Таймаут подсветки LCD (сек, 0=всегда)</label><input type="number" id="cfg-bl" step="10" min="0" max="3600" placeholder="30"></div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="saveSettings()">💾 Сохранить</button>
        <button class="btn btn-blue"  onclick="loadConfig()">↺ Загрузить</button>
        <button class="btn btn-red"   onclick="if(confirm('Перезагрузить ESP?'))doApi('/api/reboot')">↺ Перезагрузить</button>
      </div>
    </div>
    <div class="card">
      <div class="card-title">ℹ Описание</div>
      <div style="font-size:13px;color:var(--text3);line-height:2">
        <b style="color:var(--amber)">Порог тревоги</b> — изменение веса для уведомления в Telegram (роение, кража).<br>
        <b style="color:var(--amber)">Эталонный груз</b> — масса гири при калибровке HX711.<br>
        <b style="color:var(--amber)">Скорость отклика</b> — коэффициент EMA-фильтра шума. <b>В улье ставь 0.1–0.2</b> (фильтрует прилёт/вылет пчёл). <b>Для тестов 0.5–0.6</b> (быстрый отклик).<br>
        <b style="color:var(--amber)">Deep Sleep</b> — интервал сна ESP. Используется если расписание не задано.<br>
        <b style="color:var(--amber)">Расписание</b> — конкретные времена пробуждения и записи лога (напр. 08:00 14:00 20:00). Если задано — приоритет над интервалом. Пустое поле = только интервал.<br>
        <b style="color:var(--amber)">Подсветка LCD</b> — 0 = всегда включена; иначе — таймаут без нажатий.
      </div>
    </div>
    <div class="card full">
      <div class="card-title">💾 Бэкап и восстановление</div>
      <div style="font-size:13px;color:var(--text3);margin-bottom:12px;line-height:1.7">
        Скачайте полный бэкап всех настроек (калибровка, WiFi, Telegram, настройки).<br>
        При каждом сохранении настроек бэкап автоматически копируется на SD-карту.
      </div>
      <div class="btn-row" style="gap:10px;flex-wrap:wrap">
        <button class="btn btn-green" onclick="downloadBackup()">📥 Скачать бэкап</button>
        <label class="btn btn-amber" style="cursor:pointer">📤 Загрузить бэкап<input type="file" id="backup-file" accept=".json" style="display:none" onchange="restoreBackup(this)"></label>
        <button class="btn btn-blue" onclick="viewBackup()">👁 Просмотр</button>
      </div>
      <pre id="backup-preview" style="display:none;font-size:12px;color:var(--text2);line-height:1.5;margin-top:10px;max-height:200px;overflow:auto;background:var(--bg);padding:8px;border:1px solid var(--border)"></pre>
    </div>
  </div>
</div>

<!-- ═══════════════ CALIBRATION ═══════════════ -->
<div class="section" id="sec-calib">
  <div class="grid">
    <div class="card">
      <div class="card-title">🧙 Мастер калибровки</div>
      <div class="wiz-steps">
        <div class="wiz-step active" id="ws0">1</div>
        <div class="wiz-step" id="ws1">2</div>
        <div class="wiz-step" id="ws2">3</div>
        <div class="wiz-step" id="ws3">4</div>
        <div class="wiz-step" id="ws4">✓</div>
      </div>
      <div class="wiz-body" id="wiz-body"></div>
      <div class="wiz-actions">
        <button class="btn btn-amber" id="wiz-btn" onclick="wizNext()">Далее →</button>
        <button class="btn btn-red" onclick="wizReset()">↺ Сначала</button>
        <span class="wiz-cur-w">Текущий вес: <b id="wiz-w" style="color:var(--amber)">--</b> кг</span>
      </div>
    </div>
    <div class="card">
      <div class="card-title">✏ Ручная калибровка</div>
      <div class="form-row">
        <label>Cal. Factor (текущий: <b id="cf-live" style="color:var(--amber)">--</b>)</label>
        <input type="number" id="calib-cf" step="1" min="100" max="100000" placeholder="напр. 2280">
      </div>
      <div class="form-row">
        <label>Offset (текущий: <b id="ofs-live" style="color:var(--amber)">--</b>)</label>
        <input type="number" id="calib-ofs" step="1" placeholder="обычно не меняется">
      </div>
      <div class="btn-row">
        <button class="btn btn-amber" onclick="applyCalib()">✓ Применить</button>
        <button class="btn btn-blue"  onclick="doApi('/api/tare')">⊘ Тара</button>
        <button class="btn btn-green" onclick="doApi('/api/save')">💾 Сохранить эталон</button>
      </div>
      <div style="font-size:13px;color:var(--text3);margin-top:10px;line-height:1.7">
        Подберите Cal.Factor так, чтобы показание<br>совпало с реальной массой эталонного груза.
      </div>
    </div>
  </div>
</div>

<!-- ═══════════════ TELEGRAM ═══════════════ -->
<div class="section" id="sec-tg">
  <div class="grid">
    <div class="card">
      <div class="card-title">✉ Telegram Bot</div>
      <div class="form-row"><label>Bot Token (получить у @BotFather)</label><input type="password" id="tg-token" placeholder="123456789:ABC..." autocomplete="off"></div>
      <div class="form-row"><label>Chat ID (узнать через @userinfobot)</label><input type="text" id="tg-chatid" placeholder="-100123456789"></div>
      <div class="form-row"><label>Интервал отчётов (мин, 0=откл, 360=6ч, 1440=раз в день)</label><input type="number" id="tg-report-int" min="0" max="10080" step="60" placeholder="360"></div>
      <div class="btn-row">
        <button class="btn btn-green" onclick="saveTelegram()">💾 Сохранить</button>
        <button class="btn btn-blue"  onclick="doApi('/api/tg/test')">✉ Тест</button>
      </div>
    </div>
    <div class="card">
      <div class="card-title">🔔 Триггеры уведомлений</div>
      <div style="font-size:11px;color:var(--text3);line-height:2.1">
        ✓ Резкое изменение веса (порог: <b id="tg-thresh" style="color:var(--amber)">-- кг</b>)<br>
        ✓ Роение — быстрая потеря веса<br>
        ✓ Кража — резкое изменение<br>
        ✓ Низкий заряд батареи (&lt; 3.5 В)<br>
        ✓ Восстановление соединения<br>
        ✓ Тестовое сообщение (кнопка Тест)
      </div>
      <div style="font-size:13px;color:var(--text3);margin-top:10px;padding-top:10px;border-top:1px solid var(--border)">
        Для работы Telegram нужен режим Wi-Fi <b style="color:var(--amber)">STA</b> (подключение к роутеру)
      </div>
    </div>
  </div>
</div>

<!-- ═══════════════ API ═══════════════ -->
<div class="section" id="sec-api">
  <div class="card" style="margin-bottom:10px">
    <div class="card-title">🔌 REST API эндпоинты</div>
    <div class="api-grid">
      <div class="api-item"><div class="api-method get">GET /api/data</div><div class="api-desc">Все показания (вес/темп/бат/статус)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/config</div><div class="api-desc">Конфигурация (alertDelta, ema, sleep…)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/log</div><div class="api-desc">Скачать лог CSV (опц. ?date=YYYY-MM-DD)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/log/json</div><div class="api-desc">Лог в JSON (для Grafana/Home Assistant)</div></div>
      <div class="api-item"><div class="api-method get">GET /api/daystat</div><div class="api-desc">Суточная статистика (опц. ?date=)</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tare</div><div class="api-desc">Тарировка весов</div></div>
      <div class="api-item"><div class="api-method post">POST /api/save</div><div class="api-desc">Сохранить текущий вес как эталон</div></div>
      <div class="api-item"><div class="api-method post">POST /api/settings</div><div class="api-desc">Изменить настройки JSON {alertDelta…}</div></div>
      <div class="api-item"><div class="api-method post">POST /api/ntp</div><div class="api-desc">Синхронизация времени NTP</div></div>
      <div class="api-item"><div class="api-method post">POST /api/reboot</div><div class="api-desc">Перезагрузить ESP8266</div></div>
      <div class="api-item"><div class="api-method del">POST /api/log/clear</div><div class="api-desc">Очистить лог на SD/Flash</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tg/settings</div><div class="api-desc">Сохранить Telegram token/chatId</div></div>
      <div class="api-item"><div class="api-method post">POST /api/tg/test</div><div class="api-desc">Тестовое сообщение в Telegram</div></div>
      <div class="api-item"><div class="api-method post">POST /api/calib/set</div><div class="api-desc">Установить calibFactor / offset</div></div>
      <div class="api-item"><div class="api-method post">POST /api/wifi/settings</div><div class="api-desc">Режим Wi-Fi + SSID/пароль роутера</div></div>
      <div class="api-item"><div class="api-method get">GET /api/backup</div><div class="api-desc">Скачать полный бэкап настроек (JSON)</div></div>
      <div class="api-item"><div class="api-method post">POST /api/backup/restore</div><div class="api-desc">Восстановить настройки из JSON бэкапа</div></div>
    </div>
  </div>
  <div class="card">
    <div class="card-title">👁 Live /api/data
      <button class="btn btn-blue" style="padding:2px 10px;font-size:12px" onclick="refreshApiView()">↺ Обновить</button>
    </div>
    <pre id="api-json" style="font-size:13px;color:var(--text2);line-height:1.6;overflow-x:auto;white-space:pre-wrap">Загрузка...</pre>
  </div>
</div>

<div class="toast" id="toast"></div>

<script>
// ── Globals ─────────────────────────────────────────────────────────
const REFRESH = 5000;
let _start = Date.now();
let _all = [];           // весь лог
let _curWeight = 0;      // текущий вес для мини-графика
let _periodH = 1;
let _serVisible = {w:true, t:true, b:true};
let _wizStep = 0;
let _wifiMode = 0;
let _csrfTok = '';       // обновляется через /api/data
// Данные для тултипов (по серии)
let _tipPts = {};
function esc(s){var d=document.createElement('div');d.textContent=String(s);return d.innerHTML;}
// Обёртка fetch с автоматическим X-CSRF-Token для POST
function apiFetch(url, opts){
  opts = opts || {};
  opts.headers = opts.headers || {};
  if ((opts.method||'GET').toUpperCase() !== 'GET' && _csrfTok){
    opts.headers['X-CSRF-Token'] = _csrfTok;
  }
  return fetch(url, opts);
}

// ── Nav ──────────────────────────────────────────────────────────────
function nav(id) {
  document.querySelectorAll('.section').forEach(s=>s.classList.remove('active'));
  document.querySelectorAll('.tab').forEach(t=>t.classList.remove('active'));
  document.getElementById('sec-'+id).classList.add('active');
  const idx = {main:0,chart:1,wifi:2,settings:3,calib:4,tg:5,api:6};
  document.querySelectorAll('.tab')[idx[id]].classList.add('active');
  if (id==='chart') renderCharts();
  if (id==='api')   refreshApiView();
  if (id==='settings'||id==='tg') loadConfig(true);
  if (id==='wifi') loadConfig(true);
  if (id==='calib') { fetchData(); }   // немедленно обновить cf-live, ofs-live, wiz-w
}

// ── Refresh bar ───────────────────────────────────────────────────────
const bar = document.getElementById('rbar');
function tickBar() {
  const pct = Math.max(0, 100-(Date.now()-_start)/REFRESH*100);
  bar.style.width = pct+'%';
  if (Date.now()-_start < REFRESH) requestAnimationFrame(tickBar);
}
tickBar();

