darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ── Clock ─────────────────────────────────────────────────────────────
(function tick() {
  const t=new Date(), p=n=>String(n).padStart(2,'0');
  document.getElementById('cur-time').textContent = p(t.getHours())+':'+p(t.getMinutes())+':'+p(t.getSeconds());
  setTimeout(tick, 1000);
})();

// ── Toast ─────────────────────────────────────────────────────────────
function toast(msg, err) {
  const el = document.getElementById('toast');
  el.textContent=msg; el.className='toast'+(err?' err':'')+' show';
  setTimeout(()=>el.classList.remove('show'), 3500);
}

// ── API ───────────────────────────────────────────────────────────────
function doApi(url) {
  const method = (url.includes('/data')||(url.includes('/log')&&!url.includes('/clear'))||url.includes('/config')||url.includes('/daystat')||url.endsWith('/backup')) ? 'GET' : 'POST';
  return apiFetch(url,{method}).then(r=>r.json()).then(d=>{
    toast(d.msg||(d.ok?'OK':'Ошибка'), !d.ok); return d;
  }).catch(()=>toast('Нет связи',true));
}

// ── Fetch /api/data ───────────────────────────────────────────────────
function fetchData() {
  fetch('/api/data').then(r=>r.json()).then(updDash).catch(()=>{});
  fetch('/api/daystat').then(r=>r.json()).then(updHive).catch(()=>{});
  loadLog();
}

function updDash(d) {
  if (d && d.csrf) _csrfTok = d.csrf;
  if (d && d.credsDefault) showCredsWarning();
  if (d && d.fw) { const fv=document.getElementById('fw-ver'); if (fv && !fv.textContent) fv.textContent='v'+d.fw; }
  const w = parseFloat(d.weight)||0;
  _curWeight = w;
  setText('w-val', w.toFixed(3)+'<span class="val-unit">кг</span>', true);
  setText('w-ref', parseFloat(d.ref||0).toFixed(3));
  const dw = w-parseFloat(d.ref||0);
  const dwEl=document.getElementById('w-delta');
  dwEl.textContent=(dw>=0?'+':'')+dw.toFixed(3);
  dwEl.style.color=dw>0?'var(--green)':dw<0?'var(--red)':'var(--amber2)';
  setGauge('w-gauge','w-gpct', Math.min(100,w/80*100), '', '%');

  const t=parseFloat(d.temp), rtcT=parseFloat(d.rtcT||0);
  if (!isNaN(t)&&t>-90) {
    setText('t-val',t.toFixed(1)+'<span class="val-unit">°C</span>',true);
    setGauge('t-gauge','t-gpct', Math.min(100,Math.max(0,(t+20)/70*100)), t.toFixed(1), '°C');
  } else {
    setText('t-val','---<span class="val-unit">°C</span>',true);
    setGauge('t-gauge','t-gpct', 0, '---', '°C');
  }
  setText('rtc-val', rtcT.toFixed(1));

  const bv=parseFloat(d.batV||0), bp=parseFloat(d.batPct||0);
  setText('bat-v-big',bv.toFixed(2)+'<span class="val-unit">В</span>',true);
  setText('bat-pct-v',bp.toFixed(0)+'%');
  const bColor=bp<20?'var(--red)':bp<40?'var(--amber)':'var(--green)';
  document.getElementById('bat-gauge').style.background=bColor;
  setGauge('bat-gauge','bat-gpct',bp,'','%');

  // Status
  setDot('sr-dot',d.sensor,'ok','err'); setText('sr-val',d.sensor?'OK':'Ошибка');
  setDot('wf-dot',d.wifi,'ok','warn'); setText('wf-val',d.wifi?'Подключён':'AP режим');
  setText('wkc-val',d.wakeups||0);
  setText('cf-val',parseFloat(d.cf||0).toFixed(0));
  setText('ofs-val',d.offset||0);
  setText('dt-val',d.datetime||'--');
  setText('upt-val',d.uptime||'--');
  const heap=parseInt(d.heap||0);
  setText('heap-val',(heap/1024).toFixed(1)+' KB');
  setDot('heap-dot',heap>5000,'ok','warn');
  const sdKb=Math.round(parseInt(d.sdLog||0)/1024);
  const freeKb=Math.round(parseInt(d.sdFree||0)/1024);
  // Свободное место известно только при LittleFS (fallback); SD-библиотека его не отдаёт
  const freeKnown=!!d.sdFallback;
  const totalKb=freeKnown?sdKb+freeKb:0;
  const memPct=totalKb>0?Math.min(100,sdKb/totalKb*100):0;
  // Gauge памяти/лога
  const mColor=memPct>90?'var(--red)':memPct>70?'var(--amber)':'var(--green)';
  const memGauge=document.getElementById('mem-gauge');
  if(memGauge){memGauge.style.background=mColor;setGauge('mem-gauge','mem-gpct',memPct,memPct.toFixed(0),'%');}
  setText('mem-used',sdKb);setText('mem-total',freeKnown?totalKb:'?');
  // Предупреждение: ФС не смонтирована
  const fsOk=!!d.sdOk;
  const sdDot=document.getElementById('sd-dot');
  if(sdDot) sdDot.className='dot '+(fsOk?'ok':'err');
  if(fsOk) setText('sd-val',sdKb+' KB / своб. '+(freeKnown?freeKb+' KB':'н/д'));
  else setText('sd-val','⚠ ФС не доступна');

  // Calib live
  if (document.getElementById('cf-live')) setText('cf-live',parseFloat(d.cf||0).toFixed(0));
  if (document.getElementById('ofs-live')) setText('ofs-live',d.offset||0);
  if (document.getElementById('wiz-w')) setText('wiz-w',parseFloat(d.weight||0).toFixed(3));
  // Автозаполнение поля CF текущим значением, если пользователь ещё не вводил своё
  var cfInput=document.getElementById('calib-cf');
  if(cfInput&&cfInput.value===''&&d.cf) cfInput.value=Math.round(parseFloat(d.cf||0));
}

function updHive(d) {
  if (!d) return;
  const s={Vesna:'🌸 Весна',Leto:'☀ Лето',Osen:'🍂 Осень',Zima:'❄ Зима'};
  setText('hi-season',s[d.season]||d.season||'--');
  if (d.valid) {
    setText('hi-wrange',d.wMin.toFixed(2)+' / '+d.wMax.toFixed(2)+' кг');
    if (!isNaN(d.tMin)) setText('hi-trange',d.tMin.toFixed(1)+' / '+d.tMax.toFixed(1)+' °C');
    const dk=parseFloat(d.deltaKg||0);
    const de=document.getElementById('hi-delta');
    de.textContent=(dk>=0?'+':'')+dk.toFixed(3)+' кг';
    de.style.color=dk>0?'var(--green)':dk<0?'var(--red)':'var(--text2)';
    setText('hi-count',d.count||0);
    setText('hi-days',d.daysSinceStart||0);
  }
}

function setText(id,v,html) {
  const el=document.getElementById(id);
  if(!el)return;
  if(html) el.innerHTML=v; else el.textContent=v;
}
function setGauge(gid,lid,pct,val,unit) {
  const g=document.getElementById(gid),l=document.getElementById(lid);
  if(g) g.style.width=pct.toFixed(0)+'%';
  if(l) l.textContent=val+unit;
}
function setDot(id,ok,cOk,cBad) {
  const el=document.getElementById(id);
  if(el) el.className='dot '+(ok?cOk:cBad);
}

// ── Load log ──────────────────────────────────────────────────────────
function loadLog() {
  fetch('/api/log/json').then(r=>r.json()).then(data=>{
    _all = data;
    drawMini();
    if (document.getElementById('sec-chart').classList.contains('active')) renderCharts();
  }).catch(()=>{
    drawMini();
    if(document.getElementById('sec-chart').classList.contains('active')) renderCharts();
  });
}

