darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ── Mini chart ────────────────────────────────────────────────────────
function drawMini() {
  const svg=document.getElementById('mini-svg');
  if (!_all||_all.length<2) {
    const wt=_curWeight>0?_curWeight.toFixed(3)+' кг':'--';
    svg.innerHTML='<text x="450" y="120" text-anchor="middle" fill="#f5a623" font-size="28" font-weight="bold">'+wt+'</text>'+
      '<text x="450" y="150" text-anchor="middle" fill="#506040" font-size="13">Лог пуст — нет данных для графика</text>';
    return;
  }
  const pts=_all.slice(-120);
  _tipPts.mini=pts;
  drawLineSvg(svg,pts,'w','#f5a623',900,350,60,10,12,50,true);
}

// ── Chart page ────────────────────────────────────────────────────────
function setPeriod(h,btn) {
  _periodH=h;
  document.querySelectorAll('.period-btn').forEach(b=>b.classList.remove('active'));
  btn.classList.add('active');
  renderCharts();
}

function toggleSeries(s,btn) {
  _serVisible[s]=!_serVisible[s];
  btn.classList.toggle('active',_serVisible[s]);
  const wrap=document.getElementById('cwrap-'+s);
  if(wrap) wrap.style.display=_serVisible[s]?'':'none';
  renderCharts();
}

function filterPts() {
  if (!_periodH) return _all;
  const cutoff=Date.now()-_periodH*3600000;
  const f=_all.filter(d=>{
    const m=d.dt&&d.dt.match(/(\d{2})\.(\d{2})\.(\d{4})\s+(\d{2}):(\d{2}):(\d{2})/);
    if(m) return new Date(+m[3],+m[2]-1,+m[1],+m[4],+m[5],+m[6]).getTime()>=cutoff;
    return true;
  });
  // Возвращаем fallback если точек меньше 2 (drawLineSvg требует ≥2 точки)
  if (f.length < 2) {
    const n=_periodH===1?60:_periodH===6?360:_periodH*60;
    return _all.slice(-Math.min(n,_all.length));
  }
  return f;
}

function renderCharts() {
  if (!_all.length) {
    [{id:'chart-w',cy:120},{id:'chart-t',cy:90},{id:'chart-b',cy:70}].forEach(function(s){
      var svg=document.getElementById(s.id);
      if(svg) svg.innerHTML='<text x="450" y="'+s.cy+'" text-anchor="middle" fill="#506040" font-size="13">Нет данных</text>';
    });
    return;
  }
  const pts=filterPts();
  if (!pts.length) return;
  _tipPts={};

  if (_serVisible.w) {
    _tipPts.w=pts;
    const ws=pts.map(d=>parseFloat(d.w)).filter(v=>!isNaN(v));
    const mn=ws.reduce((a,b)=>a<b?a:b),mx=ws.reduce((a,b)=>a>b?a:b),av=ws.reduce((a,b)=>a+b,0)/ws.length;
    setText('c-wmin',mn.toFixed(3)); setText('c-wmax',mx.toFixed(3));
    setText('c-wavg',av.toFixed(3)); setText('c-pts',pts.length);
    drawLineSvg(document.getElementById('chart-w'),pts,'w','#f5a623',900,260,60,10,12,42,true);
  }
  if (_serVisible.t) {
    _tipPts.t=pts;
    const ts=pts.map(d=>parseFloat(d.t)).filter(v=>!isNaN(v)&&v>-90);
    if(ts.length){setText('c-tmin',ts.reduce((a,b)=>a<b?a:b).toFixed(1));setText('c-tmax',ts.reduce((a,b)=>a>b?a:b).toFixed(1));}
    drawLineSvg(document.getElementById('chart-t'),pts,'t','#56ccf2',900,260,60,10,12,42,true);
  }
  if (_serVisible.b) {
    _tipPts.b=pts;
    drawLineSvg(document.getElementById('chart-b'),pts,'b','#6fcf97',900,260,60,10,12,42,true);
  }
}

// ── Universal SVG line drawing ────────────────────────────────────────
function drawLineSvg(svg,pts,key,color,W,H,L,R,T,B,showAxes) {
  const pW=W-L-R, pH=H-T-B;
  const vals=pts.map(d=>parseFloat(d[key])).filter(v=>!isNaN(v)&&v>-90);
  if (vals.length<2) { svg.innerHTML=`<text x="${W/2}" y="${H/2}" text-anchor="middle" fill="#506040" font-size="13">Нет данных</text>`; return; }
  // Для температуры и батареи: игнорируем нули при расчёте шкалы (0 = датчик не работал / USB)
  let scaleVals=(key==='t'||key==='b')?vals.filter(v=>v>0.05):vals;
  if(scaleVals.length<2) scaleVals=vals;
  let mn=scaleVals.reduce((a,b)=>a<b?a:b),mx=scaleVals.reduce((a,b)=>a>b?a:b);
  // Добавляем 5% padding сверху/снизу чтобы линия не прилипала к краям
  const range=mx-mn||1;
  mn-=range*0.05; mx+=range*0.05;
  if(mx===mn){mn-=0.5;mx+=0.5;}
  const xS=i=>L+i/(pts.length-1||1)*pW;
  const yS=v=>T+pH-(v-mn)/(mx-mn)*pH;
  let html='';
  // grid — 6 горизонтальных линий для лучшей читаемости
  const yLines=6;
  for(let k=0;k<=yLines;k++){
    const v=mn+(mx-mn)*k/yLines,y=yS(v);
    html+=`<line x1="${L}" y1="${y.toFixed(1)}" x2="${W-R}" y2="${y.toFixed(1)}" stroke="#1a201a" stroke-width="1"/>`;
    if(showAxes) {
      const dec=key==='b'?2:key==='t'?1:3;
      html+=`<text x="${L-5}" y="${(y+4).toFixed(1)}" text-anchor="end" fill="#506040" font-size="12">${v.toFixed(dec)}</text>`;
    }
  }
  // x labels — 5-7 меток равномерно
  if(showAxes && pts.length>1){
    const xCount=Math.min(7,pts.length);
    for(let n=0;n<xCount;n++){
      const i=Math.round(n*(pts.length-1)/(xCount-1));
      const x=xS(i),lbl=pts[i].dt?esc(pts[i].dt.substring(11,16)):'';
      const a=n===0?'start':n===xCount-1?'end':'middle';
      html+=`<line x1="${x.toFixed(1)}" y1="${T}" x2="${x.toFixed(1)}" y2="${T+pH}" stroke="#181d18" stroke-dasharray="3,3" stroke-width="1"/>`;
      html+=`<text x="${x.toFixed(1)}" y="${H-B+16}" text-anchor="${a}" fill="#506040" font-size="11">${lbl}</text>`;
    }
    // date labels at edges — под осью X, не наложение на время
    const d0=pts[0].dt?esc(pts[0].dt.substring(0,10)):'';
    const d1=pts[pts.length-1].dt?esc(pts[pts.length-1].dt.substring(0,10)):'';
    if(d0) html+=`<text x="${L}" y="${H-B+28}" text-anchor="start" fill="#3d5030" font-size="9">${d0}</text>`;
    if(d1&&d1!==d0) html+=`<text x="${W-R}" y="${H-B+28}" text-anchor="end" fill="#3d5030" font-size="9">${d1}</text>`;
  }
  // axes
  if(showAxes){
    html+=`<line x1="${L}" y1="${T}" x2="${L}" y2="${T+pH}" stroke="#506040" stroke-width="1.5"/>`;
    html+=`<line x1="${L}" y1="${T+pH}" x2="${W-R}" y2="${T+pH}" stroke="#506040" stroke-width="1.5"/>`;
  }
  // area + line
  let area='',line='',li=-1;
  for(let i=0;i<pts.length;i++){
    const v=parseFloat(pts[i][key]);
    if(isNaN(v)||v<=-90) continue;
    if((key==='t'||key==='b')&&Math.abs(v)<0.05&&scaleVals!==vals) continue;
    const xx=xS(i).toFixed(1),yy=yS(v).toFixed(1);
    if(li<0){area=`M ${xx} ${T+pH}`;line=`M ${xx} ${yy}`;}
    else{area+=` L ${xx} ${yy}`;line+=` L ${xx} ${yy}`;}
    li=i;
  }
  if(li>=0){
    area+=` L ${xS(li).toFixed(1)} ${T+pH} Z`;
    html+=`<path d="${area}" fill="${color}18" stroke="none"/>`;
    html+=`<path d="${line}" fill="none" stroke="${color}" stroke-width="2"/>`;
    const lv=parseFloat(pts[li][key]);
    html+=`<circle cx="${xS(li).toFixed(1)}" cy="${yS(lv).toFixed(1)}" r="4" fill="${color}"/>`;
  }
  svg.innerHTML=html;
}

// ── Tooltip ───────────────────────────────────────────────────────────
function onTip(e,s){
  const pts=_tipPts[s];
  if(!pts||!pts.length) return;
  const key={w:'w',t:'t',b:'b',mini:'w'}[s];
  const color={w:'var(--amber)',t:'var(--blue)',b:'var(--green)',mini:'var(--amber)'}[s];
  const unit={w:' кг',t:' °C',b:' В',mini:' кг'}[s];
  const W=900,L=60,R=10;
  const pW=W-L-R;
  const svg=e.currentTarget, rect=svg.getBoundingClientRect();
  const svgX=(e.clientX-rect.left)/rect.width*W;
  let best=-1,bestD=9999;
  for(let i=0;i<pts.length;i++){const x=L+i/(pts.length-1||1)*pW,d=Math.abs(x-svgX);if(d<bestD){bestD=d;best=i;}}
  if(best<0||bestD>pW/pts.length*3){hideTip(s);return;}
  const p=pts[best], v=parseFloat(p[key]);
  const tip=document.getElementById('tip-'+s);
  tip.innerHTML=`<b style="color:${color}">${isNaN(v)||v<=-90?'--':v.toFixed(key==='b'?3:2)+unit}</b><br>${esc(p.dt||'')}`;
  tip.style.display='';
  let tx=(e.clientX-rect.left)+10, ty=(e.clientY-rect.top)-48;
  if(tx+140>rect.width) tx=(e.clientX-rect.left)-150;
  if(ty<0) ty=10;
  tip.style.left=tx+'px'; tip.style.top=ty+'px';
}
function hideTip(s){const el=document.getElementById('tip-'+s);if(el)el.style.display='none';}

// ── Export ────────────────────────────────────────────────────────────
function getExpData() {
  let data=_all;
  const from=document.getElementById('exp-from').value;
  const to=document.getElementById('exp-to').value;
  if(from||to) data=data.filter(d=>{
    if(!d.dt) return true;
    const m=d.dt.match(/(\d{2})\.(\d{2})\.(\d{4})/);
    if(!m) return true;
    const ds=`${m[3]}-${m[2]}-${m[1]}`;
    return (!from||ds>=from)&&(!to||ds<=to);
  });
  const cols=[];
  if(document.getElementById('col-dt').checked)  cols.push({k:'dt',h:'Дата/время'});
  if(document.getElementById('col-w').checked)   cols.push({k:'w',h:'Вес, кг'});
  if(document.getElementById('col-t').checked)   cols.push({k:'t',h:'Темп, °C'});
  if(document.getElementById('col-bat').checked) cols.push({k:'b',h:'Батарея, В'});
  return {data,cols};
}

