darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
function exportCsv(){
  const {data,cols}=getExpData();
  let csv='\uFEFF'+cols.map(c=>c.h).join(';')+'\n';
  data.forEach(d=>{csv+=cols.map(c=>d[c.k]||'').join(';')+'\n';});
  dlBlob(new Blob([csv],{type:'text/csv;charset=utf-8'}),'beehive_log.csv');
}

function previewExport(){
  const {data,cols}=getExpData();
  let html=`<tr>${cols.map(c=>`<th>${esc(c.h)}</th>`).join('')}</tr>`;
  data.slice(-10).forEach(d=>{html+=`<tr>${cols.map(c=>`<td>${esc(d[c.k]||'')}</td>`).join('')}</tr>`;});
  document.getElementById('prev-table').innerHTML=html;
  document.getElementById('preview-wrap').style.display='block';
}

function exportExcel(){
  if(typeof XLSX==='undefined'){
    const s=document.createElement('script');
    s.src='https://cdnjs.cloudflare.com/ajax/libs/xlsx/0.18.5/xlsx.full.min.js';
    s.onload=_doExcel; s.onerror=()=>toast('Excel недоступен (нет интернета/AP режим)',true); document.head.appendChild(s);
  } else _doExcel();
}
function _doExcel(){
  const {data,cols}=getExpData();
  const rows=data.map(d=>{const r={};cols.forEach(c=>{r[c.h]=d[c.k]||'';});return r;});
  const ws=XLSX.utils.json_to_sheet(rows);
  const vals=data.map(d=>parseFloat(d.w)).filter(v=>!isNaN(v));
  const stat=[['Параметр','Значение'],['Записей',data.length],
    ['Мин вес',vals.length?vals.reduce((a,b)=>a<b?a:b).toFixed(3):''],
    ['Макс вес',vals.length?vals.reduce((a,b)=>a>b?a:b).toFixed(3):''],
    ['Среднее', vals.length?(vals.reduce((a,b)=>a+b,0)/vals.length).toFixed(3):'']];
  const ws2=XLSX.utils.aoa_to_sheet(stat);
  const days={};
  data.forEach(d=>{const k=d.dt?d.dt.substring(0,10):'?';if(!days[k])days[k]={mn:999,mx:-999,n:0};const v=parseFloat(d.w);if(!isNaN(v)){days[k].mn=Math.min(days[k].mn,v);days[k].mx=Math.max(days[k].mx,v);days[k].n++;}});
  const ws3=XLSX.utils.aoa_to_sheet([['Дата','Мин кг','Макс кг','Точек'],...Object.entries(days).map(([k,v])=>[k,v.mn.toFixed(3),v.mx.toFixed(3),v.n])]);
  const wb=XLSX.utils.book_new();
  XLSX.utils.book_append_sheet(wb,ws,'Данные');
  XLSX.utils.book_append_sheet(wb,ws2,'Статистика');
  XLSX.utils.book_append_sheet(wb,ws3,'Дневные итоги');
  XLSX.writeFile(wb,'beehive_log.xlsx');
}

function dlBlob(blob,name){const a=document.createElement('a');const u=URL.createObjectURL(blob);a.href=u;a.download=name;a.click();setTimeout(()=>URL.revokeObjectURL(u),5000);}
function dlSdDate(){const d=document.getElementById('exp-date-sd').value;if(!d){toast('Выберите дату',true);return;}window.open('/api/log?date='+d,'_blank');}

// ── Backup ─────────────────────────────────────────────────────────────
function downloadBackup(){window.open('/api/backup','_blank');}
function viewBackup(){
  fetch('/api/backup').then(r=>r.json()).then(d=>{
    const el=document.getElementById('backup-preview');
    el.textContent=JSON.stringify(d,null,2);
    el.style.display=el.style.display==='none'?'block':'none';
  }).catch(()=>toast('Нет связи',true));
}
function restoreBackup(inp){
  const file=inp.files[0];
  if(!file){return;}
  if(!file.name.endsWith('.json')){toast('Нужен .json файл',true);inp.value='';return;}
  const reader=new FileReader();
  reader.onload=function(e){
    let json;
    try{json=JSON.parse(e.target.result);}catch(ex){toast('Ошибка: не JSON',true);inp.value='';return;}
    if(json._type!=='BeehiveScale_backup'){toast('Неверный формат бэкапа',true);inp.value='';return;}
    if(!confirm('Восстановить ВСЕ настройки из бэкапа?\n(калибровка, WiFi, Telegram, параметры)\n\nТекущие настройки будут перезаписаны!')){inp.value='';return;}
    apiFetch('/api/backup/restore',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(json)})
      .then(r=>r.json()).then(d=>{toast(d.msg||'OK',!d.ok);if(d.ok)loadConfig();}).catch(()=>toast('Нет связи',true));
  };
  reader.readAsText(file);
  inp.value='';
}

// ── Load config ───────────────────────────────────────────────────────
// silent=true — без toast (используется при переключении вкладок)
function loadConfig(silent){
  fetch('/api/config').then(r=>r.json()).then(d=>{
    const setV=(id,v)=>{const el=document.getElementById(id);if(el&&v!==undefined)el.value=v;};
    setV('cfg-alert',d.alertDelta); setV('cfg-calib',d.calibWeight);
    setV('cfg-ema',d.emaAlpha);     setV('cfg-sleep',d.sleepSec);
    setV('cfg-bl',d.lcdBlSec);
    setV('cfg-sched',(d.schedTimes&&d.schedTimes.length>0)?d.schedTimes.join(' '):'');
    // Токен НЕ заполняем в input — он замаскирован звёздочками, а placeholder покажет статус
    if(d.tgTokenSet){document.getElementById('tg-token').placeholder='Токен задан (оставьте пустым чтобы не менять)';}
    setV('tg-chatid',d.tgChatId);
    if(d.tgReportInt!==undefined) setV('tg-report-int',d.tgReportInt);
    if(d.alertDelta) setText('tg-thresh',d.alertDelta+' кг');
    selWm(parseInt(d.wifiMode||0),true);
    if(d.wifiSsid) setV('wifi-ssid',d.wifiSsid);
    if(!silent) toast('Настройки загружены');
  }).catch(()=>{if(!silent) toast('Нет связи',true);});
}

// ── Save settings ─────────────────────────────────────────────────────
function saveSettings(){
  const body={};
  const g=(id)=>document.getElementById(id);
  const a=parseFloat(g('cfg-alert').value),c=parseFloat(g('cfg-calib').value);
  const e=parseFloat(g('cfg-ema').value),s=parseInt(g('cfg-sleep').value),b=parseInt(g('cfg-bl').value);
  if(!isNaN(a)) body.alertDelta=a;
  if(!isNaN(c)) body.calibWeight=c;
  if(!isNaN(e)) body.emaAlpha=e;
  if(!isNaN(s)) body.sleepSec=s;
  if(!isNaN(b)) body.lcdBlSec=b;
  const sched=(g('cfg-sched').value||'').trim();
  body.schedTimes=sched.length>0?sched.split(/\s+/).filter(t=>/^\d{1,2}:\d{2}$/.test(t)):[];
  apiFetch('/api/settings',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>toast(d.msg||'OK',!d.ok)).catch(()=>toast('Нет связи',true));
}

// ── Telegram ──────────────────────────────────────────────────────────
function saveTelegram(){
  const ri=parseInt(document.getElementById('tg-report-int').value||'360');
  const body={token:document.getElementById('tg-token').value,chatId:document.getElementById('tg-chatid').value,reportInt:isNaN(ri)?360:Math.max(0,Math.min(ri,10080))};
  apiFetch('/api/tg/settings',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>toast(d.msg||'OK',!d.ok)).catch(()=>toast('Нет связи',true));
}

// ── WiFi ──────────────────────────────────────────────────────────────
function selWm(mode, noUpdate){
  _wifiMode=mode;
  document.getElementById('wopt-ap').classList.toggle('sel',mode===0);
  document.getElementById('wopt-sta').classList.toggle('sel',mode===1);
  document.querySelectorAll('input[name="wm"]').forEach((r,i)=>r.checked=i===mode);
  const sb=document.getElementById('sta-block');
  if(sb) sb.style.display=mode===1?'block':'none';
}
function saveWifi(){
  const body={wifiMode:_wifiMode};
  if(_wifiMode===1){
    const ssid=document.getElementById('wifi-ssid').value.trim();
    const pass=document.getElementById('wifi-pass').value;
    if(!ssid){toast('Введите SSID роутера',true);return;}
    body.wifiSsid=ssid;
    if(pass.length>0) body.wifiPass=pass;
  }
  apiFetch('/api/wifi/settings',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{
      toast(d.msg||'OK',!d.ok);
      if(d.ok) setTimeout(()=>toast('Устройство перезагружается…'),2500);
    }).catch(()=>toast('Нет связи',true));
}

// ── AP Password ───────────────────────────────────────────────────────
function checkPassStrength(inId,barId){
  const v=document.getElementById(inId).value;
  const bar=document.getElementById(barId);
  const len=v.length;
  const hasUpper=/[A-Z]/.test(v), hasNum=/[0-9]/.test(v), hasSym=/[^A-Za-z0-9]/.test(v);
  const score=Math.min(4,(len>=8?1:0)+(len>=12?1:0)+(hasUpper?1:0)+(hasNum?1:0)+(hasSym?1:0));
  const colors=['','var(--red)','var(--red)','var(--amber)','var(--green)'];
  bar.style.width=(score*25)+'%';
  bar.style.background=colors[score]||'var(--border)';
}

function saveApPass(){
  const np=document.getElementById('ap-pass-new').value;
  const cp=document.getElementById('ap-pass-confirm').value;
  if(np.length<8||np.length>23){toast('Пароль: 8–23 символа',true);return;}
  if(np!==cp){toast('Пароли не совпадают',true);return;}
  const body={apPass:np};
  apiFetch('/api/settings',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{
      toast(d.msg||'OK',!d.ok);
      if(d.ok){document.getElementById('ap-pass-new').value='';document.getElementById('ap-pass-confirm').value='';}
    }).catch(()=>toast('Нет связи',true));
}

function showCredsWarning(){
  var el=document.getElementById('creds-warn');
  if(el) el.style.display='block';
}

function saveWebAuth(){
  const u=document.getElementById('web-user-new').value.trim();
  const p=document.getElementById('web-pass-new').value;
  const c=document.getElementById('web-pass-confirm').value;
  if(p.length<6||p.length>31){toast('Пароль: 6-31 символ',true);return;}
  if(p!==c){toast('Пароли не совпадают',true);return;}
  if(!confirm('Сменить логин/пароль веб-интерфейса?\nБраузер потребует переавторизацию.')) return;
  const body={pass:p};
  if(u.length>0) body.user=u;
  apiFetch('/api/auth/password',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{
      toast(d.msg||'OK',!d.ok);
      if(d.ok){
        ['web-user-new','web-pass-new','web-pass-confirm'].forEach(id=>document.getElementById(id).value='');
        setTimeout(()=>location.reload(),1500);
      }
    }).catch(()=>toast('Нет связи',true));
}

function saveOtaPass(){
  const p=document.getElementById('ota-pass-new').value;
  if(p.length<6||p.length>31){toast('OTA пароль: 6-31 символ',true);return;}
  apiFetch('/api/auth/ota',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({pass:p})})
    .then(r=>r.json()).then(d=>{
      toast(d.msg||'OK',!d.ok);
      if(d.ok) document.getElementById('ota-pass-new').value='';
    }).catch(()=>toast('Нет связи',true));
}

