darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ── Calibration wizard ────────────────────────────────────────────────
const WIZ=[
  {l:'Пусто',   b:'<b>Шаг 1: Уберите все грузы.</b><br>Платформа весов должна быть абсолютно пустой. Нажмите «Далее».'},
  {l:'Тара',    b:'<b>Шаг 2: Тарировка.</b><br>Нажмите «Тарировать» — показание обнулится.<br>Текущий вес должен стать близким к 0.'},
  {l:'Груз',    b:'<b>Шаг 3: Поставьте эталонный груз.</b><br>Используйте гирю с известной массой (задана в Настройках).<br>Дождитесь стабилизации показания.'},
  {l:'Cal.F.',  b:'<b>Шаг 4: Подберите Cal.Factor.</b><br>В правой панели «Ручная калибровка» введите CF и нажмите «Применить».<br>Добивайтесь совпадения «Вес (wiz)» с реальной массой груза. Поле CF автозаполнено текущим значением.'},
  {l:'Готово',  b:'<b>✓ Калибровка завершена!</b><br>Уберите груз → Тарировка → «Сохранить эталон» на главной.'},
];
function updateWiz(){
  WIZ.forEach((_,i)=>{
    document.getElementById('ws'+i).className='wiz-step'+(i<_wizStep?' done':i===_wizStep?' active':'');
  });
  document.getElementById('wiz-body').innerHTML=WIZ[_wizStep].b;
  const btn=document.getElementById('wiz-btn');
  btn.textContent=_wizStep===1?'⊘ Тарировать':_wizStep===WIZ.length-1?'↺ Заново':'Далее →';
}
function wizNext(){
  if(_wizStep===1){doApi('/api/tare').then(()=>setTimeout(fetchData,1500));_wizStep++;updateWiz();return;}
  if(_wizStep===WIZ.length-1){wizReset();return;}
  _wizStep++;updateWiz();
}
function wizReset(){_wizStep=0;updateWiz();}

function applyCalib(){
  const cf=parseFloat(document.getElementById('calib-cf').value);
  const ofs=document.getElementById('calib-ofs').value;
  const body={};
  if(!isNaN(cf)) body.calibFactor=cf;
  if(ofs!=='') body.offset=parseInt(ofs);
  if(Object.keys(body).length===0){toast('Введите значение Cal.Factor',true);return;}
  apiFetch('/api/calib/set',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)})
    .then(r=>r.json()).then(d=>{toast(d.msg||'OK',!d.ok);if(d.ok)fetchData();}).catch(()=>toast('Нет связи',true));
}

// ── API viewer ────────────────────────────────────────────────────────
function refreshApiView(){
  fetch('/api/data').then(r=>r.json()).then(d=>{
    document.getElementById('api-json').textContent=JSON.stringify(d,null,2);
  }).catch(()=>{document.getElementById('api-json').textContent='Нет связи';});
}

// ── Dates init ────────────────────────────────────────────────────────
(function initDates(){
  const now=new Date();
  const fmt=d=>`${d.getFullYear()}-${String(d.getMonth()+1).padStart(2,'0')}-${String(d.getDate()).padStart(2,'0')}`;
  const today=fmt(now), weekAgo=fmt(new Date(now-7*86400000));
  ['exp-date-sd'].forEach(id=>{const el=document.getElementById(id);if(el)el.value=today;});
  document.getElementById('exp-from').value=weekAgo;
  document.getElementById('exp-to').value=today;
})();

// ── Auto refresh ───────────────────────────────────────────────────────
function autoRefresh(){
  _start=Date.now(); tickBar(); fetchData();
  setTimeout(autoRefresh,REFRESH);
}

// ── Init ──────────────────────────────────────────────────────────────
updateWiz();
fetchData();
setTimeout(autoRefresh,REFRESH);
</script>
</body></html>

)rawhtml";

// Настройки читаются/записываются через Memory.h (web_get_*/save_web_settings)

// Маскировка секретов: XXXX***YYYY — всегда 4 первых + 4 последних символа реального src,
// середина ровно 3 звёздочки. Безопасно для произвольно длинных строк (TG-токен ~46 байт).
static String _maskSecret(const char *src) {
  if (!src) return "";
  size_t len = strlen(src);
  if (len == 0) return "";
  if (len <= 8) return "****";
  char buf[16];
  snprintf(buf, sizeof(buf), "%c%c%c%c***%c%c%c%c",
           src[0], src[1], src[2], src[3],
           src[len-4], src[len-3], src[len-2], src[len-1]);
  return String(buf);
}

// ─── Uptime в читаемом виде ───────────────────────────────────────────────
static String _uptime() {
  unsigned long s = millis() / 1000UL;
  char buf[16];
  snprintf(buf, sizeof(buf), "%lud%02lu:%02lu:%02lu",
           s/86400, (s%86400)/3600, (s%3600)/60, s%60);
  return String(buf);
}

// _buildPage() удалён — страница полностью статическая, данные через AJAX

// ─── JSON ответ ───────────────────────────────────────────────────────────
static void _sendJson(bool ok, const String &msg) {
  StaticJsonDocument<128> doc;
  doc["ok"]  = ok;
  doc["msg"] = msg;
  String out; serializeJson(doc, out);
  _srv.send(ok ? 200 : 400, "application/json", out);
}

// ─── Маршруты ─────────────────────────────────────────────────────────────
static inline void _activity() {
  lastActivityTime = millis();
  if (_wa.onActivity) _wa.onActivity();
}
static inline void _keepalive() {
  // GET-поллинг НЕ сбрасывает таймер авто-сна — иначе deep sleep никогда не сработает
}

// Отправка PROGMEM-строки чанками (без копирования всего в heap)
static void _sendProgmemChunked(const char *pgm) {
  if (!pgm) { _srv.send(500, "text/plain", "No content"); return; }
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "text/html; charset=utf-8", "");
  size_t total = strlen_P(pgm);
  size_t sent = 0;
  char chunk[512];
  while (sent < total) {
    size_t n = min((size_t)sizeof(chunk), total - sent);
    memcpy_P(chunk, pgm + sent, n);
    _srv.sendContent(chunk, n);
    yield();
    sent += n;
  }
}

static void _handleRoot() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

// ─── /api/config  GET — начальные значения для форм настроек ─────────────
static void _handleConfig() {
  if (!_auth()) return;
  _keepalive();  // GET-поллинг — не сбрасывать таймер авто-сна
  StaticJsonDocument<640> doc;
  doc["alertDelta"]  = web_get_alert_delta();
  doc["calibWeight"] = web_get_calib_weight();
  doc["emaAlpha"]    = web_get_ema_alpha();
  doc["sleepSec"]    = (unsigned long)get_sleep_sec();
  doc["lcdBlSec"]    = (unsigned int)get_lcd_bl_sec();
  doc["wifiMode"]    = (int)get_wifi_mode();
  // НЕ использовать block scope для char-буферов + ArduinoJson!
  // ArduinoJson v6 для char* хранит указатель (zero-copy) — dangling pointer если буфер на стеке.
  // Оборачиваем в String() чтобы ArduinoJson скопировал содержимое.
  {
    char ss[33]; get_wifi_ssid(ss, sizeof(ss));
    doc["wifiSsid"] = String(ss);
  }
  {
    char tgTok[50], tgCid[16];
    get_tg_token(tgTok, sizeof(tgTok));
    get_tg_chatid(tgCid, sizeof(tgCid));
    doc["tgToken"]  = _maskSecret(tgTok);
    doc["tgChatId"] = String(tgCid);
    doc["tgTokenSet"] = (tgTok[0] != '\0');
    doc["tgReportInt"] = get_tg_report_interval_min();
  }
  {
    uint16_t times[8]; uint8_t cnt;
    get_sched_times(times, cnt);
    JsonArray arr = doc.createNestedArray("schedTimes");
    char tbuf[6];
    for (uint8_t i = 0; i < cnt; i++) {
      snprintf(tbuf, sizeof(tbuf), "%02d:%02d", times[i] / 60, times[i] % 60);
      arr.add(String(tbuf));
    }
  }
  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

static void _handleData() {
  if (!_auth()) return;
  static unsigned long _lastDataReq = 0;
  if (!_rate_limit(_lastDataReq, 1000UL)) return;
  _keepalive();  // поллинг — не сбрасывать подсветку
  if (_csrfToken[0] == '\0') _csrf_init();
  StaticJsonDocument<512> doc;
  doc["weight"]   = *_wd.weight;
  doc["ref"]      = *_wd.lastSavedWeight;
  doc["prev"]     = *_wd.prevWeight;
  doc["temp"]     = *_wd.tempC;
  doc["rtcT"]     = *_wd.rtcTempC;
  doc["sensor"]   = *_wd.sensorReady;
  doc["wifi"]     = *_wd.wifiOk;
  doc["datetime"] = *_wd.datetime;
  doc["uptime"]   = _uptime();
  doc["wakeups"]  = *_wd.wakeupCount;
  doc["cf"]       = *_wd.calibFactor;
  doc["offset"]   = *_wd.offset;
  doc["batV"]     = *_wd.batVoltage;
  doc["batPct"]   = *_wd.batPercent;
  doc["sdLog"]      = (unsigned long)log_size();
  doc["sdFree"]     = (unsigned long)log_free_space();
  doc["sdFallback"] = log_using_fallback();
  doc["sdOk"]       = log_fs_ok() ? 1 : 0;
  doc["csrf"]         = _csrfToken;
  doc["credsDefault"] = credentials_is_default();
  doc["fw"]           = FW_VERSION;
#if defined(ESP32) || defined(ESP8266)
  doc["heap"]     = ESP.getFreeHeap();
#else
  doc["heap"]     = 0;
#endif
  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

