darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
static void _handleTare() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_wa.doTare) { _wa.doTare(); _sendJson(true, "Тарировка выполнена"); }
  else _sendJson(false, "Нет обработчика");
}

static void _handleSave() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_wa.doSave) { _wa.doSave(); _sendJson(true, "Эталон сохранён"); }
  else _sendJson(false, "Нет обработчика");
}

// Forward declaration — используется в авто-бэкапе при сохранении настроек
// masked=true: секреты замаскированы (для GET /api/backup), false: полные (для SD-файла)
static String _buildBackupJson(bool masked = false);

static void _handleSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  _activity();
  StaticJsonDocument<512> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }

  // Валидация входных данных
  float newAlert  = web_get_alert_delta();
  float newCalib  = web_get_calib_weight();
  float newAlpha  = web_get_ema_alpha();

  if (doc.containsKey("alertDelta")) {
    float val = doc["alertDelta"].as<float>();
    if (val >= 0.1f && val <= 10.0f) {
      newAlert = val;
    } else {
      _sendJson(false, "alertDelta должен быть от 0.1 до 10.0 кг");
      return;
    }
  }

  if (doc.containsKey("calibWeight")) {
    float val = doc["calibWeight"].as<float>();
    if (val >= 100.0f && val <= 50000.0f) {
      newCalib = val;
    } else {
      _sendJson(false, "calibWeight должен быть от 100 до 50000 г");
      return;
    }
  }

  if (doc.containsKey("emaAlpha")) {
    float val = doc["emaAlpha"].as<float>();
    if (val >= 0.05f && val <= 0.9f) {
      newAlpha = val;
    } else {
      _sendJson(false, "emaAlpha должен быть от 0.05 до 0.9");
      return;
    }
  }

  // Валидация расширенных настроек ДО записи
  uint32_t newSleepSec = 0; bool hasSleepSec = false;
  uint16_t newLcdBlSec = 0;  bool hasLcdBlSec = false;
  const char* newApPass = nullptr;
  if (doc.containsKey("sleepSec")) {
    uint32_t val = doc["sleepSec"].as<uint32_t>();
    if (val >= 30UL && val <= 86400UL) { newSleepSec = val; hasSleepSec = true; }
    else { _sendJson(false, "sleepSec: 30–86400"); return; }
  }
  if (doc.containsKey("lcdBlSec")) {
    uint16_t val = doc["lcdBlSec"].as<uint16_t>();
    if (val <= 3600) { newLcdBlSec = val; hasLcdBlSec = true; }
    else { _sendJson(false, "lcdBlSec: 0–3600"); return; }
  }
  char apPassBuf[24];  // локальная — безопасно при параллельных запросах (пункт 20)
  apPassBuf[0] = '\0';
  if (doc.containsKey("apPass")) {
    const char* pass = doc["apPass"].as<const char*>();
    if (pass && strlen(pass) >= 8 && strlen(pass) <= 23) {
      strncpy(apPassBuf, pass, sizeof(apPassBuf) - 1);
      apPassBuf[sizeof(apPassBuf) - 1] = '\0';
      newApPass = apPassBuf;
    }
    else { _sendJson(false, "apPass: 8–23 символа"); return; }
  }

  // Все поля валидны — сохраняем в EEPROM
  save_web_settings(newAlert, newCalib, newAlpha);
  // Batch: ext settings — один commit вместо 3 отдельных
  if (hasSleepSec || hasLcdBlSec || newApPass) {
    set_ext_all(
      hasSleepSec ? newSleepSec : get_sleep_sec(),
      hasLcdBlSec ? newLcdBlSec : get_lcd_bl_sec(),
      newApPass
    );
  }
  if (doc.containsKey("schedTimes")) {
    JsonArray arr = doc["schedTimes"].as<JsonArray>();
    uint16_t times[8]; uint8_t cnt = 0;
    for (JsonVariant v : arr) {
      const char* s = v.as<const char*>();
      if (!s) continue;
      int h = 0, m = 0;
      if (sscanf(s, "%d:%d", &h, &m) == 2 && h >= 0 && h <= 23 && m >= 0 && m <= 59) {
        if (cnt < 8) times[cnt++] = (uint16_t)h * 60 + m;
      }
    }
    set_sched_times(times, cnt);
  }

  // Авто-бэкап на SD при изменении настроек
  log_save_backup(_buildBackupJson());

  _sendJson(true, "Сохранено");
}

static void _handleReboot() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  // Отправляем JSON целиком и даём TCP время выпихнуть данные до сокета клиента.
  // client().stop() здесь ЗАПРЕЩЁН — обрубит сокет до того как клиент прочитает body.
  _sendJson(true, "Перезагрузка...");
  _srv.client().flush();
  delay(200);
  ESP.restart();
}

// Обработчик NTP синхронизации
static void _handleNtp() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }

  Serial.println(F("[Web] NTP sync requested..."));

  if (ntp_sync_time()) {
    _sendJson(true, "Время синхронизировано");
  } else {
    _sendJson(false, "Ошибка синхронизации");
  }
}

static void _handleChart() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

static void _handleWifi() {
  if (!_auth()) return;
  _activity();
  _sendProgmemChunked(PAGE_HTML);
}

// ─── /api/tg/settings  POST — сохранить Telegram токен и chat_id ─────────
static void _handleTgSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  // Batch: собираем token и chatId, один commit через set_tg_all()
  const char* newToken = NULL;
  const char* newChatId = NULL;
  if (doc.containsKey("token")) {
    const char* t = doc["token"].as<const char*>();
    if (t && strlen(t) > 0 && strlen(t) < 50 && strchr(t, '*') == NULL) newToken = t;
    else if (t && strlen(t) == 0) newToken = "";
  }
  if (doc.containsKey("chatId")) {
    const char* c = doc["chatId"].as<const char*>();
    if (c && strlen(c) < 16) newChatId = c;
  }
  if (newToken || newChatId) set_tg_all(newToken, newChatId);
  if (doc.containsKey("reportInt")) {
    uint32_t v = doc["reportInt"].as<uint32_t>();
    // 0 = откл, минимум 60 мин, максимум 10080 (7 дней)
    if (v == 0 || (v >= 60 && v <= 10080)) set_tg_report_interval_min(v);
  }
  log_save_backup(_buildBackupJson());
  _sendJson(true, "Telegram настройки сохранены");
}

// ─── /api/tg/test  POST — отправить тестовое/приветственное сообщение ────
static void _handleTgTest() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();

  // Справка: что бот присылает и как настроить
  char info[512];
  uint32_t rptMin = get_tg_report_interval_min();
  float alertKg = web_get_alert_delta();
  snprintf(info, sizeof(info),
    "<b>" FW_NAME " v" FW_VERSION "</b>\n\n"
    "<b>Chto prihodit:</b>\n"
    "- <b>Otchet</b> — ves, temp, vlazhnost (kazhdye %lu min%s)\n"
    "- <b>Trevoga</b> — pri izmenenii vesa na %.1f+ kg (kuldaun 30 min)\n\n"
    "<b>Veb-panel: http://192.168.4.1</b>\n"
    "- Podklyuchenie k Wi-Fi routeru\n"
    "- Interval otchetov, porog trevogi\n"
    "- Raspisanie zamerov\n"
    "- Grafiki, eksport CSV, kalibrovka",
    (unsigned long)(rptMin ? rptMin : 0),
    rptMin ? "" : ", otkl",
    alertKg);

  bool ok = tg_send_message(info);
  _sendJson(ok, ok ? "Сообщение отправлено" : "Ошибка отправки (проверьте token/chat_id)");
}

// ─── /api/calib/set  POST — установить cal.factor и offset ───────────────
static void _handleCalibSet() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<128> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  bool changed = false;
  if (doc.containsKey("calibFactor") && _wa.doSetCalibFactor) {
    float cf = doc["calibFactor"].as<float>();
    if (cf >= 100.0f && cf <= 100000.0f) {
      _wa.doSetCalibFactor(cf);
      changed = true;
    } else { _sendJson(false,"calibFactor: 100–100000"); return; }
  }
  if (doc.containsKey("offset") && _wa.doSetCalibOffset) {
    long ofs = doc["offset"].as<long>();
    _wa.doSetCalibOffset(ofs);
    changed = true;
  }
  if (changed) { log_save_backup(_buildBackupJson()); _sendJson(true, "Калибровка обновлена"); }
  else _sendJson(false, "Нет данных для обновления");
}

// ─── /api/wifi/settings  POST — сохранить режим WiFi и credentials ──────
static void _handleWifiSettings() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false,"Только POST"); return; }
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false,"Ошибка JSON"); return; }
  if (!doc.containsKey("wifiMode")) { _sendJson(false,"Нет wifiMode"); return; }
  uint8_t mode = doc["wifiMode"].as<uint8_t>();
  if (mode > 1) { _sendJson(false,"wifiMode: 0 или 1"); return; }
  // Batch: один commit через set_wifi_all() вместо 3 отдельных
  const char *ssid = NULL;
  const char *pass = NULL;
  if (mode == 1) {
    ssid = doc["wifiSsid"].as<const char*>();
    pass = doc["wifiPass"].as<const char*>();
    if (!ssid || strlen(ssid) == 0) { _sendJson(false,"Введите SSID роутера"); return; }
    if (strlen(ssid) > 32) { _sendJson(false,"SSID слишком длинный (макс 32)"); return; }
    if (pass && strlen(pass) > 32) { _sendJson(false,"Пароль слишком длинный (макс 32)"); return; }
  }
  set_wifi_all(mode, ssid, pass);
  log_save_backup(_buildBackupJson());
  _sendJson(true, "WiFi настройки сохранены, перезагрузка...");
  _srv.client().flush();
  delay(200);
  ESP.restart();
}

static void _handleNotFound() {
  _srv.send(404, "text/plain", "Not found");
}

// ─── /api/auth/password  POST — смена admin login/пароля ─────────────────
// Body: { "user": "newlogin", "pass": "newpass" }  (user опционален)
static void _handleAuthPassword() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false, "Только POST"); return; }
  _activity();
  StaticJsonDocument<192> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false, "Ошибка JSON"); return; }
  const char* u = doc["user"].as<const char*>();
  const char* p = doc["pass"].as<const char*>();
  if (!p || strlen(p) < 6 || strlen(p) > 31) {
    _sendJson(false, "Пароль: 6-31 символ");
    return;
  }
  if (u && (strlen(u) < 3 || strlen(u) > 23)) {
    _sendJson(false, "Логин: 3-23 символа");
    return;
  }
  set_admin_credentials(u, p);
  _sendJson(true, "Учётные данные обновлены. Переавторизация при следующем запросе.");
}

// ─── /api/auth/ota  POST — смена OTA пароля ──────────────────────────────
static void _handleAuthOta() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  if (_srv.method() != HTTP_POST) { _sendJson(false, "Только POST"); return; }
  _activity();
  StaticJsonDocument<128> doc;
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false, "Ошибка JSON"); return; }
  const char* p = doc["pass"].as<const char*>();
  if (!p || strlen(p) < 6 || strlen(p) > 31) {
    _sendJson(false, "OTA пароль: 6-31 символ");
    return;
  }
  set_ota_pass(p);
  _sendJson(true, "OTA пароль сохранён. Вступит в силу после перезагрузки.");
}

