darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ─── /api/log  GET — скачать CSV-лог (опционально: ?date=YYYY-MM-DD) ─────
static void _handleLog() {
  if (!_auth()) return;
  static unsigned long _lastLogCsvReq = 0;
  if (!_rate_limit(_lastLogCsvReq, 1000UL)) return;
  _activity();
  if (!log_exists()) {
    _srv.send(404, "text/plain", "Log not found");
    return;
  }
  String date = _srv.arg("date");  // "" если параметр не передан
  // Санитизация: только цифры, '-' и '.', длина ≤10 (защита от HTTP header injection)
  if (date.length() > 0) {
    if (date.length() > 10) date = date.substring(0, 10);
    for (unsigned int i = 0; i < date.length(); i++) {
      char ch = date[i];
      if (!isdigit(ch) && ch != '-' && ch != '.') {
        _srv.send(400, "text/plain", "Bad date");
        return;
      }
    }
  }
  if (date.length() == 0) {
    // Без фильтра — стримим весь файл напрямую
    File f;
#ifdef USE_SD_CARD
    if (log_using_fallback()) {
      f = LittleFS.open(LOG_FILE, "r");
    } else {
      f = SD.open(LOG_FILE, FILE_READ);
    }
#else
    f = LOG_FS.open(LOG_FILE, "r");
#endif
    if (!f) { _srv.send(500, "text/plain", "Cannot open log"); return; }
    _srv.sendHeader("Content-Disposition", "attachment; filename=\"beehive_log.csv\"");
    _srv.streamFile(f, "text/csv");
    f.close();
  } else {
    // С фильтром по дате — стримим чанками (chunked transfer) для экономии heap
    String fname = "beehive_" + date + ".csv";
    _srv.sendHeader("Content-Disposition", "attachment; filename=\"" + fname + "\"");
    _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
    _srv.send(200, "text/csv; charset=utf-8", "");
    {
      class ChunkStream : public Stream {
      public:
        WebServerCompat &srv;
        char buf[256];
        uint16_t pos;
        ChunkStream(WebServerCompat &s) : srv(s), pos(0) {}
        size_t write(uint8_t c) override {
          buf[pos++] = (char)c;
          if (pos >= sizeof(buf)) _flush_buf();
          return 1;
        }
        size_t write(const uint8_t *b, size_t s) override {
          size_t sent = 0;
          while (sent < s) {
            size_t n = (s - sent > 512) ? 512 : (s - sent);
            if (pos > 0) _flush_buf();
            srv.sendContent((const char*)(b + sent), n);
            sent += n;
            yield();  // WDT safe: не блокировать loop при стриме CSV
          }
          return s;
        }
        void _flush_buf() { if (pos > 0) { srv.sendContent(buf, pos); pos = 0; } }
        int available() override { return 0; }
        int read()      override { return -1; }
        int peek()      override { return -1; }
        void flush()    override { _flush_buf(); }
      } cs(_srv);
      log_stream_csv_date(cs, date);
      cs.flush();
    }
  }
}

// ─── /api/daystat  GET — суточная статистика (фичи 12, 17) ──────────────
static void _handleDayStat() {
  if (!_auth()) return;
  _keepalive();  // GET-поллинг — не сбрасывать подсветку
  // Дата из параметра или текущая из RTC
  String date = _srv.arg("date");
  // Санитизация: только цифры, '-' и '.', длина ≤10 (защита от инъекций)
  if (date.length() > 0) {
    if (date.length() > 10) date = date.substring(0, 10);
    for (unsigned int i = 0; i < date.length(); i++) {
      char ch = date[i];
      if (!isdigit(ch) && ch != '-' && ch != '.') {
        _srv.send(400, "text/plain", "Bad date");
        return;
      }
    }
  }
  if (date.length() == 0) date = *_wd.datetime;  // "DD.MM.YYYY HH:MM:SS" → берём первые 10
  if (date.length() > 10) date = date.substring(0, 10);
  if (date.length() < 10) {
    _sendJson(false, "Дата недоступна");
    return;
  }
  // Нормализация: YYYY-MM-DD → DD.MM.YYYY (единый формат для season/days/log_day_stat)
  if (date.length() == 10 && date.charAt(4) == '-') {
    // "YYYY-MM-DD" → "DD.MM.YYYY"
    date = date.substring(8, 10) + "." + date.substring(5, 7) + "." + date.substring(0, 4);
  }

  DayStat ds = log_day_stat(date);

  StaticJsonDocument<256> doc;
  doc["date"]   = date;
  doc["valid"]  = ds.valid;
  doc["wMin"]   = ds.valid ? ds.wMin : 0;
  doc["wMax"]   = ds.valid ? ds.wMax : 0;
  doc["tMin"]   = (ds.valid && ds.tMin < 1e8f) ? ds.tMin : (float)NAN;
  doc["tMax"]   = (ds.valid && ds.tMax > -1e8f) ? ds.tMax : (float)NAN;
  doc["count"]  = ds.count;

  // Фича 17: информация об улье
  // Сезон по месяцу (date уже нормализован к DD.MM.YYYY)
  int month = 0;
  if (date.length() >= 7) month = date.substring(3, 5).toInt();
  const char* season =
    (month >= 3 && month <= 5)  ? "Vesna" :
    (month >= 6 && month <= 8)  ? "Leto"  :
    (month >= 9 && month <= 11) ? "Osen"  : "Zima";
  doc["season"] = season;

  // Дней наблюдений: разница между текущей и первой датой лога
  // Обе даты в формате DD.MM.YYYY после нормализации
  {
    char firstDate[12];
    int days = 0;
    if (log_first_date(firstDate, sizeof(firstDate)) && date.length() >= 10) {
      int d1 = atoi(firstDate);      int m1 = atoi(firstDate + 3);  int y1 = atoi(firstDate + 6);
      int d2 = atoi(date.c_str());   int m2 = atoi(date.c_str()+3); int y2 = atoi(date.c_str()+6);
      long e1 = (long)y1*365 + y1/4 - y1/100 + y1/400 + (m1*306+5)/10 + d1;
      long e2 = (long)y2*365 + y2/4 - y2/100 + y2/400 + (m2*306+5)/10 + d2;
      days = (int)(e2 - e1);
      if (days < 0) days = 0;
    }
    doc["daysSinceStart"] = days > 0 ? days : (log_size() > 100 ? 1 : 0);
  }

  // Последнее значительное изменение — дельта текущий - опорный
  doc["deltaKg"] = *_wd.weight - *_wd.prevWeight;

  String out; serializeJson(doc, out);
  _srv.send(200, "application/json", out);
}

// ─── /api/log/clear  POST — очистить лог ─────────────────────────────────
static void _handleLogClear() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  log_clear();
  _sendJson(true, "Лог очищен");
}

// ─── /api/log/json  GET — лог в JSON ─────────────────────────────────────
// Стримит прямо в HTTP-ответ через ChunkStream — без аккумуляции 4КБ String в heap.
static void _handleLogJson() {
  if (!_auth()) return;
  static unsigned long _lastLogReq = 0;
  if (!_rate_limit(_lastLogReq, 1000UL)) return;
  _keepalive();
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "application/json", "");
  class JsonChunkStream : public Stream {
  public:
    WebServerCompat &srv;
    char buf[128];
    uint16_t pos;
    JsonChunkStream(WebServerCompat &s) : srv(s), pos(0) {}
    size_t write(uint8_t c) override {
      buf[pos++] = (char)c;
      if (pos >= sizeof(buf)) flush_buf();
      return 1;
    }
    size_t write(const uint8_t *b, size_t s) override {
      for (size_t i = 0; i < s; i++) write(b[i]);
      return s;
    }
    void flush_buf() { if (pos > 0) { srv.sendContent(buf, pos); pos = 0; } }
    int available() override { return 0; }
    int read() override { return -1; }
    int peek() override { return -1; }
    void flush() override { flush_buf(); }
  } cs(_srv);
  log_stream_json(cs, 50);
  cs.flush();
}

