darkvolg/BeehiveScale-ESP32/BeehiveScale/WebServerModule.cpp
// ─── /api/backup  GET — полный бэкап настроек EEPROM ──────────────────────
static String _buildBackupJson(bool masked) {
  DynamicJsonDocument doc(768);
  doc["_type"] = "BeehiveScale_backup";
  doc["_ver"]  = FW_VERSION;

  // Калибровка
  doc["calibFactor"]  = *_wd.calibFactor;
  doc["offset"]       = *_wd.offset;
  doc["weight"]       = *_wd.lastSavedWeight;
  doc["prevWeight"]   = *_wd.prevWeight;
  doc["prevOffset"]   = load_prev_offset();

  // Настройки
  doc["alertDelta"]   = web_get_alert_delta();
  doc["calibWeight"]  = web_get_calib_weight();
  doc["emaAlpha"]     = web_get_ema_alpha();
  doc["sleepSec"]     = (unsigned long)get_sleep_sec();
  doc["lcdBlSec"]     = (unsigned int)get_lcd_bl_sec();
  {
    uint16_t times[8]; uint8_t cnt;
    get_sched_times(times, cnt);
    JsonArray arr = doc.createNestedArray("schedTimes");
    char tbuf[6];
    for (uint8_t i = 0; i < cnt; i++) {
      snprintf(tbuf, sizeof(tbuf), "%02d:%02d", times[i] / 60, times[i] % 60);
      arr.add(String(tbuf));
    }
  }

  // AP пароль
  // НЕ использовать (const char*) каст! ArduinoJson v6 для const char* хранит указатель
  // (zero-copy), а char* — копирует строку в пул. Каст → dangling pointer после }.
  char ap[24]; get_ap_pass(ap, sizeof(ap));
  doc["apPass"] = masked ? _maskSecret(ap) : String(ap);

  // Telegram
  char tok[50], cid[16];
  get_tg_token(tok, sizeof(tok));
  get_tg_chatid(cid, sizeof(cid));
  doc["tgToken"]  = masked ? _maskSecret(tok) : String(tok);
  doc["tgChatId"] = String(cid);
  doc["tgReportInt"] = get_tg_report_interval_min();

  // WiFi
  doc["wifiMode"] = (int)get_wifi_mode();
  char ss[33], wp[33];
  get_wifi_ssid(ss, sizeof(ss));
  get_wifi_sta_pass(wp, sizeof(wp));
  doc["wifiSsid"] = String(ss);
  doc["wifiPass"] = masked ? _maskSecret(wp) : String(wp);

  String out;
  serializeJson(doc, out);
  return out;
}

static void _handleBackup() {
  if (!_auth()) return;
  _keepalive();
  // Стримим чанками: один DynamicJsonDocument пишется в WiFiClient через
  // _srv.sendContent-обёртку, без промежуточного String (экономия ~2КБ heap).
  // Неманскированный вариант сохраняем на SD отдельным вызовом — один раз в heap.
  log_save_backup(_buildBackupJson(false));

  _srv.sendHeader("Content-Disposition", "attachment; filename=\"beehive_backup.json\"");
  _srv.setContentLength(CONTENT_LENGTH_UNKNOWN);
  _srv.send(200, "application/json", "");

  String json = _buildBackupJson(true);
  const size_t CHUNK = 256;
  size_t total = json.length();
  size_t sent = 0;
  while (sent < total) {
    size_t n = (total - sent > CHUNK) ? CHUNK : (total - sent);
    _srv.sendContent(json.c_str() + sent, n);
    sent += n;
    yield();
  }
}

// ─── /api/backup/restore  POST — восстановление из JSON бэкапа ───────────
static void _handleBackupRestore() {
  if (!_auth()) return;
  if (!_csrf_check()) return;
  _activity();
  if (_srv.method() != HTTP_POST) { _sendJson(false, "Только POST"); return; }

  DynamicJsonDocument doc(768);
  DeserializationError err = deserializeJson(doc, _srv.arg("plain"));
  if (err) { _sendJson(false, "Ошибка JSON"); return; }

  // Проверяем маркер бэкапа
  const char* type = doc["_type"] | "";
  if (strcmp(type, "BeehiveScale_backup") != 0) {
    _sendJson(false, "Неверный формат бэкапа");
    return;
  }

  int restored = 0;

  // Калибровка: собираем все поля и делаем ОДИН commit через save_calibration_block()
  // вместо 5 отдельных — экономия flash wear + WDT safe.
  {
    float cf = NAN; long ofs = INT32_MIN; float w = NAN; float pw = NAN; long po = INT32_MIN;
    if (doc.containsKey("calibFactor")) {
      float v = doc["calibFactor"].as<float>();
      if (v >= 100.0f && v <= 100000.0f) { cf = v; restored++; }
    }
    if (doc.containsKey("offset")) {
      ofs = doc["offset"].as<long>();
      if (ofs > -16777216L && ofs < 16777216L) restored++; else ofs = INT32_MIN;
    }
    if (doc.containsKey("weight")) {
      float v = doc["weight"].as<float>();
      if (v >= 0.0f && v <= 500.0f) { w = v; restored++; }
    }
    if (doc.containsKey("prevWeight")) {
      float v = doc["prevWeight"].as<float>();
      if (v >= 0.0f && v <= 500.0f) { pw = v; restored++; }
    }
    if (doc.containsKey("prevOffset")) {
      po = doc["prevOffset"].as<long>();
      if (po > -16777216L && po < 16777216L) restored++; else po = INT32_MIN;
    }
    save_calibration_block(cf, ofs, w, pw, po);
    // Применяем значения к runtime
    if (!isnan(cf) && _wa.doSetCalibFactor) _wa.doSetCalibFactor(cf);
    if (ofs != INT32_MIN && _wa.doSetCalibOffset) _wa.doSetCalibOffset(ofs);
    if (!isnan(w)) *_wd.lastSavedWeight = w;
    if (!isnan(pw)) *_wd.prevWeight = pw;
#if defined(ESP8266)
    ESP.wdtFeed();
#endif
  }

  // Настройки
  float ad = web_get_alert_delta(), cw = web_get_calib_weight(), ea = web_get_ema_alpha();
  if (doc.containsKey("alertDelta"))  { float v = doc["alertDelta"].as<float>();  if (v >= 0.1f && v <= 10.0f) { ad = v; restored++; } }
  if (doc.containsKey("calibWeight")) { float v = doc["calibWeight"].as<float>(); if (v >= 100.0f && v <= 50000.0f) { cw = v; restored++; } }
  if (doc.containsKey("emaAlpha"))    { float v = doc["emaAlpha"].as<float>();    if (v >= 0.05f && v <= 0.9f) { ea = v; restored++; } }
  save_web_settings(ad, cw, ea);
#if defined(ESP8266)
  ESP.wdtFeed();
#endif

  // Ext settings — batch: один commit вместо 3
  {
    uint32_t extSleep = get_sleep_sec();
    uint16_t extLcd   = get_lcd_bl_sec();
    const char* extAp = nullptr;
    if (doc.containsKey("sleepSec")) { uint32_t v = doc["sleepSec"].as<uint32_t>(); if (v >= 30 && v <= 86400) { extSleep = v; restored++; } }
    if (doc.containsKey("lcdBlSec")) { uint16_t v = doc["lcdBlSec"].as<uint16_t>(); if (v <= 3600) { extLcd = v; restored++; } }
    static char apPassRestore[24];
    if (doc.containsKey("apPass"))   { const char* p = doc["apPass"] | ""; if (strlen(p) >= 8 && strlen(p) <= 23 && strchr(p, '*') == NULL) { strncpy(apPassRestore, p, sizeof(apPassRestore)-1); apPassRestore[sizeof(apPassRestore)-1] = '\0'; extAp = apPassRestore; restored++; } }
    set_ext_all(extSleep, extLcd, extAp);
  }
  if (doc.containsKey("schedTimes")) {
    JsonArray arr = doc["schedTimes"].as<JsonArray>();
    uint16_t times[8]; uint8_t cnt = 0;
    for (JsonVariant v : arr) {
      const char* s = v.as<const char*>();
      if (!s) continue;
      int h = 0, m = 0;
      if (sscanf(s, "%d:%d", &h, &m) == 2 && h >= 0 && h <= 23 && m >= 0 && m <= 59) {
        if (cnt < 8) times[cnt++] = (uint16_t)h * 60 + m;
      }
    }
    set_sched_times(times, cnt); restored++;
  }

  // Telegram — batch: собираем поля, один commit через set_tg_all()
  {
    const char* newTkn = nullptr;
    const char* newCid = nullptr;
    if (doc.containsKey("tgToken"))  { const char* t = doc["tgToken"] | "";  if (strlen(t) > 0 && strchr(t, '*') == NULL) { newTkn = t; restored++; } }
    if (doc.containsKey("tgChatId")) { const char* c = doc["tgChatId"] | ""; if (strlen(c) > 0 && strlen(c) < 16) { newCid = c; restored++; } }
    if (newTkn || newCid) set_tg_all(newTkn, newCid);
  }
  if (doc.containsKey("tgReportInt")) { uint32_t v = doc["tgReportInt"].as<uint32_t>(); if (v == 0 || (v >= 60 && v <= 10080)) { set_tg_report_interval_min(v); restored++; } }

  // WiFi — batch: собираем поля, один commit через set_wifi_all()
  {
    bool hasWifi = false;
    uint8_t mode = get_wifi_mode();
    char ssid[33]; get_wifi_ssid(ssid, sizeof(ssid));
    char pass[33]; get_wifi_sta_pass(pass, sizeof(pass));
    if (doc.containsKey("wifiMode")) { uint8_t m = doc["wifiMode"].as<uint8_t>(); if (m <= 1) { mode = m; hasWifi = true; restored++; } }
    if (doc.containsKey("wifiSsid")) { const char* s = doc["wifiSsid"] | ""; if (strlen(s) > 0) { strncpy(ssid, s, 32); ssid[32] = '\0'; hasWifi = true; restored++; } }
    if (doc.containsKey("wifiPass")) { const char* p = doc["wifiPass"] | ""; if (strlen(p) > 0 && strchr(p, '*') == NULL) { strncpy(pass, p, 32); pass[32] = '\0'; hasWifi = true; restored++; } }
    if (hasWifi) set_wifi_all(mode, ssid, pass);
  }

  char msg[64];
  snprintf(msg, sizeof(msg), "Восстановлено %d параметров", restored);
  _sendJson(true, msg);
}

// ─── PUBLIC API ───────────────────────────────────────────────────────────
static bool _routesBound = false;

void webserver_init(WebData &data, WebActions &actions) {
  _wd = data;
  _wa = actions;

  // Идемпотентность: при повторном вызове после WiFi reconnect не регистрируем
  // handlers второй раз — ESP8266WebServer внутри хранит их в vector и дубли
  // приводят к двойным срабатываниям и утечкам памяти.
  _srv.stop();  // фикс пункта 7: перед begin() корректно закрыть предыдущий сокет
  if (!_routesBound) {
    _srv.on("/",             HTTP_GET,  _handleRoot);
    _srv.on("/api/data",     HTTP_GET,  _handleData);
    _srv.on("/api/tare",     HTTP_POST, _handleTare);
    _srv.on("/api/save",     HTTP_POST, _handleSave);
    _srv.on("/api/settings",   HTTP_POST, _handleSettings);
    _srv.on("/api/ntp",        HTTP_POST, _handleNtp);
    _srv.on("/api/reboot",     HTTP_POST, _handleReboot);
    _srv.on("/api/log",          HTTP_GET,  _handleLog);
    _srv.on("/api/daystat",      HTTP_GET,  _handleDayStat);
    _srv.on("/api/log/clear",    HTTP_POST, _handleLogClear);
    _srv.on("/api/log/json",     HTTP_GET,  _handleLogJson);
    _srv.on("/chart",            HTTP_GET,  _handleChart);
    _srv.on("/api/tg/settings",  HTTP_POST, _handleTgSettings);
    _srv.on("/api/tg/test",      HTTP_POST, _handleTgTest);
    _srv.on("/api/calib/set",    HTTP_POST, _handleCalibSet);
    _srv.on("/wifi",              HTTP_GET,  _handleWifi);
    _srv.on("/api/wifi/settings", HTTP_POST, _handleWifiSettings);
    _srv.on("/api/config",        HTTP_GET,  _handleConfig);
    _srv.on("/api/backup",          HTTP_GET,  _handleBackup);
    _srv.on("/api/backup/restore",  HTTP_POST, _handleBackupRestore);
    _srv.on("/api/auth/password",   HTTP_POST, _handleAuthPassword);
    _srv.on("/api/auth/ota",        HTTP_POST, _handleAuthOta);
    _srv.onNotFound(_handleNotFound);

    // Нужно явно запросить сохранение заголовка X-CSRF-Token — иначе server.header()
    // вернёт пустую строку (ESP8266WebServer по умолчанию не буферизирует headers).
    _srv.collectHeaders("X-CSRF-Token");
    _routesBound = true;
  }

  _csrf_init();
  _srv.begin();
  Serial.print(F("[WebServer] Started on port "));
  Serial.print(WEB_SERVER_PORT);
  Serial.print(F("  http://"));
  Serial.println(get_wifi_mode() == 0 ? WiFi.softAPIP() : WiFi.localIP());
}

void webserver_handle() {
  _srv.handleClient();
}

void webserver_stop() {
  _srv.stop();
  Serial.println(F("[WebServer] Stopped"));
}
